esp-rs/esp-pacs/esp32p4-lp/svd/esp32p4-lp.base.svd
<?xml version='1.0' encoding='UTF-8'?>
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
  <vendor>ESPRESSIF SYSTEMS (SHANGHAI) CO., LTD.</vendor>
  <vendorID>ESPRESSIF</vendorID>
  <name>ESP32-P4-LP</name>
  <series>ESP32 P-Series</series>
  <version>3</version>
  <description>32-bit RISC-V LP coprocessor on ESP32-P4 (ECO5+ silicon only)</description>
  <licenseText>
    Copyright 2026 Espressif Systems (Shanghai) PTE LTD

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
</licenseText>
  <cpu>
    <name>RV32IMAC</name>
    <revision>r0p0</revision>
    <endian>little</endian>
    <mpuPresent>false</mpuPresent>
    <fpuPresent>false</fpuPresent>
    <nvicPrioBits>0</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>32</addressUnitBits>
  <width>32</width>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <peripherals>
    <peripheral>
      <name>HP2LP_PERI_PMS</name>
      <description>HP2LP_PERI_PMS</description>
      <groupName>HP2LP_PERI_PMS</groupName>
      <baseAddress>0x5012E800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x000000e0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>TEE_HP2LP_TEE_PMS_DATE</name>
          <addressOffset>0x0</addressOffset>
          <description>NA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEE_TEE_DATE</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEE_PMS_CLK_EN</name>
          <addressOffset>0x4</addressOffset>
          <description>NA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEE_REG_CLK_EN</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEE_HP_CORE0_MM_PMS_REG0</name>
          <addressOffset>0x8</addressOffset>
          <description>NA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEE_REG_HP_CORE0_MM_LP_SYSREG_ALLOW</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_MM_LP_AONCLKRST_ALLOW</name>
              <description>NA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_MM_LP_TIMER_ALLOW</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_MM_LP_ANAPERI_ALLOW</name>
              <description>NA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_MM_LP_PMU_ALLOW</name>
              <description>NA</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_MM_LP_WDT_ALLOW</name>
              <description>NA</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_MM_LP_MAILBOX_ALLOW</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_MM_LP_RTC_ALLOW</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_MM_LP_PERICLKRST_ALLOW</name>
              <description>NA</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_MM_LP_UART_ALLOW</name>
              <description>NA</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_MM_LP_I2C_ALLOW</name>
              <description>NA</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_MM_LP_SPI_ALLOW</name>
              <description>NA</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_MM_LP_I2CMST_ALLOW</name>
              <description>NA</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_MM_LP_I2S_ALLOW</name>
              <description>NA</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_MM_LP_ADC_ALLOW</name>
              <description>NA</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_MM_LP_TOUCH_ALLOW</name>
              <description>NA</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_MM_LP_IOMUX_ALLOW</name>
              <description>NA</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_MM_LP_INTR_ALLOW</name>
              <description>NA</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_MM_LP_EFUSE_ALLOW</name>
              <description>NA</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_MM_LP_PMS_ALLOW</name>
              <description>NA</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_MM_HP2LP_PMS_ALLOW</name>
              <description>NA</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_MM_LP_TSENS_ALLOW</name>
              <description>NA</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_MM_LP_HUK_ALLOW</name>
              <description>NA</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_MM_LP_TCM_RAM_ALLOW</name>
              <description>NA</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_MM_LP_TRNG_ALLOW</name>
              <description>NA</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEE_HP_CORE0_UM_PMS_REG0</name>
          <addressOffset>0xc</addressOffset>
          <description>NA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEE_REG_HP_CORE0_UM_LP_SYSREG_ALLOW</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_UM_LP_AONCLKRST_ALLOW</name>
              <description>NA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_UM_LP_TIMER_ALLOW</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_UM_LP_ANAPERI_ALLOW</name>
              <description>NA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_UM_LP_PMU_ALLOW</name>
              <description>NA</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_UM_LP_WDT_ALLOW</name>
              <description>NA</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_UM_LP_MAILBOX_ALLOW</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_UM_LP_RTC_ALLOW</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_UM_LP_PERICLKRST_ALLOW</name>
              <description>NA</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_UM_LP_UART_ALLOW</name>
              <description>NA</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_UM_LP_I2C_ALLOW</name>
              <description>NA</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_UM_LP_SPI_ALLOW</name>
              <description>NA</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_UM_LP_I2CMST_ALLOW</name>
              <description>NA</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_UM_LP_I2S_ALLOW</name>
              <description>NA</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_UM_LP_ADC_ALLOW</name>
              <description>NA</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_UM_LP_TOUCH_ALLOW</name>
              <description>NA</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_UM_LP_IOMUX_ALLOW</name>
              <description>NA</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_UM_LP_INTR_ALLOW</name>
              <description>NA</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_UM_LP_EFUSE_ALLOW</name>
              <description>NA</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_UM_LP_PMS_ALLOW</name>
              <description>NA</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_UM_HP2LP_PMS_ALLOW</name>
              <description>NA</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_UM_LP_TSENS_ALLOW</name>
              <description>NA</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_UM_LP_HUK_ALLOW</name>
              <description>NA</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_UM_LP_TCM_RAM_ALLOW</name>
              <description>NA</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_UM_LP_TRNG_ALLOW</name>
              <description>NA</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEE_HP_CORE1_MM_PMS_REG0</name>
          <addressOffset>0x10</addressOffset>
          <description>NA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEE_REG_HP_CORE1_MM_LP_SYSREG_ALLOW</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_MM_LP_AONCLKRST_ALLOW</name>
              <description>NA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_MM_LP_TIMER_ALLOW</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_MM_LP_ANAPERI_ALLOW</name>
              <description>NA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_MM_LP_PMU_ALLOW</name>
              <description>NA</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_MM_LP_WDT_ALLOW</name>
              <description>NA</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_MM_LP_MAILBOX_ALLOW</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_MM_LP_RTC_ALLOW</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_MM_LP_PERICLKRST_ALLOW</name>
              <description>NA</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_MM_LP_UART_ALLOW</name>
              <description>NA</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_MM_LP_I2C_ALLOW</name>
              <description>NA</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_MM_LP_SPI_ALLOW</name>
              <description>NA</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_MM_LP_I2CMST_ALLOW</name>
              <description>NA</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_MM_LP_I2S_ALLOW</name>
              <description>NA</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_MM_LP_ADC_ALLOW</name>
              <description>NA</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_MM_LP_TOUCH_ALLOW</name>
              <description>NA</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_MM_LP_IOMUX_ALLOW</name>
              <description>NA</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_MM_LP_INTR_ALLOW</name>
              <description>NA</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_MM_LP_EFUSE_ALLOW</name>
              <description>NA</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_MM_LP_PMS_ALLOW</name>
              <description>NA</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_MM_HP2LP_PMS_ALLOW</name>
              <description>NA</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_MM_LP_TSENS_ALLOW</name>
              <description>NA</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_MM_LP_HUK_ALLOW</name>
              <description>NA</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_MM_LP_TCM_RAM_ALLOW</name>
              <description>NA</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_MM_LP_TRNG_ALLOW</name>
              <description>NA</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
