esp-rs/esp-pacs/esp32p4-lp/svd/esp32p4-lp.base.svd
        <register>
          <name>TEE_HP_CORE1_UM_PMS_REG0</name>
          <addressOffset>0x14</addressOffset>
          <description>NA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEE_REG_HP_CORE1_UM_LP_SYSREG_ALLOW</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_UM_LP_AONCLKRST_ALLOW</name>
              <description>NA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_UM_LP_TIMER_ALLOW</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_UM_LP_ANAPERI_ALLOW</name>
              <description>NA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_UM_LP_PMU_ALLOW</name>
              <description>NA</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_UM_LP_WDT_ALLOW</name>
              <description>NA</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_UM_LP_MAILBOX_ALLOW</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_UM_LP_RTC_ALLOW</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_UM_LP_PERICLKRST_ALLOW</name>
              <description>NA</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_UM_LP_UART_ALLOW</name>
              <description>NA</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_UM_LP_I2C_ALLOW</name>
              <description>NA</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_UM_LP_SPI_ALLOW</name>
              <description>NA</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_UM_LP_I2CMST_ALLOW</name>
              <description>NA</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_UM_LP_I2S_ALLOW</name>
              <description>NA</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_UM_LP_ADC_ALLOW</name>
              <description>NA</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_UM_LP_TOUCH_ALLOW</name>
              <description>NA</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_UM_LP_IOMUX_ALLOW</name>
              <description>NA</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_UM_LP_INTR_ALLOW</name>
              <description>NA</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_UM_LP_EFUSE_ALLOW</name>
              <description>NA</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_UM_LP_PMS_ALLOW</name>
              <description>NA</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_UM_HP2LP_PMS_ALLOW</name>
              <description>NA</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_UM_LP_TSENS_ALLOW</name>
              <description>NA</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_UM_LP_HUK_ALLOW</name>
              <description>NA</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_UM_LP_TCM_RAM_ALLOW</name>
              <description>NA</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_UM_LP_TRNG_ALLOW</name>
              <description>NA</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEE_REGDMA_PERI_PMS</name>
          <addressOffset>0x18</addressOffset>
          <description>NA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEE_REG_REGDMA_PERI_LP_RAM_ALLOW</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_REGDMA_PERI_LP_PERI_ALLOW</name>
              <description>NA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
