esp-rs/esp-pacs/esp32p4-lp/svd/esp32p4-lp.base.svd
        <register>
          <name>LP_ANA_TOUCH_WORK_MEAS_NUM</name>
          <description>need_des</description>
          <addressOffset>0x10c</addressOffset>
          <size>32</size>
          <resetValue>0x6419064</resetValue>
          <fields>
            <field>
              <name>LP_ANA_TOUCH_MEAS_NUM2</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_MEAS_NUM1</name>
              <description>need_des</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_MEAS_NUM0</name>
              <description>need_des</description>
              <bitOffset>20</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_TOUCH_FILTER1</name>
          <description>need_des</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <resetValue>0x6a0a0200</resetValue>
          <fields>
            <field>
              <name>LP_ANA_TOUCH_NEG_NOISE_DISUPDATE_BASELINE_EN</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_HYSTERESIS</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_NEG_NOISE_THRES</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_NOISE_THRES</name>
              <description>need_des</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_SMOOTH_LVL</name>
              <description>need_des</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_JITTER_STEP</name>
              <description>need_des</description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_FILTER_MODE</name>
              <description>need_des</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_FILTER_EN</name>
              <description>need_des</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_NEG_NOISE_LIMIT</name>
              <description>need_des</description>
              <bitOffset>17</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_APPROACH_LIMIT</name>
              <description>need_des</description>
              <bitOffset>21</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_DEBOUNCE_LIMIT</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_TOUCH_FILTER2</name>
          <description>need_des</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <resetValue>0x1fff8000</resetValue>
          <fields>
            <field>
              <name>LP_ANA_TOUCH_OUTEN</name>
              <description>need_des</description>
              <bitOffset>15</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_BYPASS_NOISE_THRES</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_BYPASS_NEG_NOISE_THRES</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_TOUCH_FILTER3</name>
          <description>need_des</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_ANA_TOUCH_BASELINE_SW</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_UPDATE_BASELINE_SW</name>
              <description>need_des</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_TOUCH_SLP0</name>
          <description>need_des</description>
          <addressOffset>0x11c</addressOffset>
          <size>32</size>
          <resetValue>0x1e0000</resetValue>
          <fields>
            <field>
              <name>LP_ANA_TOUCH_SLP_TH0</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_SLP_CHANNEL_CLR</name>
              <description>need_des</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_SLP_PAD</name>
              <description>need_des</description>
              <bitOffset>17</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_TOUCH_SLP1</name>
          <description>need_des</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_ANA_TOUCH_SLP_TH2</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_SLP_TH1</name>
              <description>need_des</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_TOUCH_CLR</name>
          <description>need_des</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_ANA_TOUCH_CHANNEL_CLR</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_STATUS_CLR</name>
              <description>need_des</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_TOUCH_APPROACH</name>
          <description>need_des</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <resetValue>0xfff</resetValue>
          <fields>
            <field>
              <name>PAD0</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD1</name>
              <description>need_des</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD2</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_SLP_APPROACH_EN</name>
              <description>need_des</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_TOUCH_FREQ0_SCAN_PARA</name>
          <description>need_des</description>
          <addressOffset>0x12c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_ANA_TOUCH_FREQ0_DCAP_LPF</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_FREQ0_DRES_LPF</name>
              <description>need_des</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_FREQ0_DRV_LS</name>
              <description>need_des</description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_FREQ0_DRV_HS</name>
              <description>need_des</description>
              <bitOffset>13</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_FREQ0_DBIAS</name>
              <description>need_des</description>
              <bitOffset>18</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_TOUCH_FREQ1_SCAN_PARA</name>
          <description>need_des</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_ANA_TOUCH_FREQ1_DCAP_LPF</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_FREQ1_DRES_LPF</name>
              <description>need_des</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_FREQ1_DRV_LS</name>
              <description>need_des</description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_FREQ1_DRV_HS</name>
              <description>need_des</description>
              <bitOffset>13</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_FREQ1_DBIAS</name>
              <description>need_des</description>
              <bitOffset>18</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_TOUCH_FREQ2_SCAN_PARA</name>
          <description>need_des</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_ANA_TOUCH_FREQ2_DCAP_LPF</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_FREQ2_DRES_LPF</name>
              <description>need_des</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_FREQ2_DRV_LS</name>
              <description>need_des</description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_FREQ2_DRV_HS</name>
              <description>need_des</description>
              <bitOffset>13</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_FREQ2_DBIAS</name>
              <description>need_des</description>
              <bitOffset>18</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_TOUCH_ANA_PARA</name>
          <description>need_des</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_ANA_TOUCH_TOUCH_BUF_DRV</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_TOUCH_EN_CAL</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_TOUCH_DCAP_CAL</name>
              <description>need_des</description>
              <bitOffset>4</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_TOUCH_MUX0</name>
          <description>need_des</description>
          <addressOffset>0x13c</addressOffset>
          <size>32</size>
          <resetValue>0x20000000</resetValue>
          <fields>
            <field>
              <name>LP_ANA_TOUCH_DATA_SEL</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_FREQ_SEL</name>
              <description>need_des</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_BUFSEL</name>
              <description>need_des</description>
              <bitOffset>12</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_DONE_EN</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_DONE_FORCE</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_FSM_EN</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_START_EN</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_START_FORCE</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_TOUCH_MUX1</name>
          <description>need_des</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_ANA_TOUCH_START</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_XPD</name>
              <description>need_des</description>
              <bitOffset>15</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_TOUCH_PAD0_TH0</name>
          <description>need_des</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_ANA_TOUCH_PAD0_TH0</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_TOUCH_PAD0_TH1</name>
          <description>need_des</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_ANA_TOUCH_PAD0_TH1</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_TOUCH_PAD0_TH2</name>
          <description>need_des</description>
          <addressOffset>0x14c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_ANA_TOUCH_PAD0_TH2</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_TOUCH_PAD1_TH0</name>
          <description>need_des</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_ANA_TOUCH_PAD1_TH0</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_TOUCH_PAD1_TH1</name>
          <description>need_des</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_ANA_TOUCH_PAD1_TH1</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_TOUCH_PAD1_TH2</name>
          <description>need_des</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_ANA_TOUCH_PAD1_TH2</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_TOUCH_PAD2_TH0</name>
          <description>need_des</description>
          <addressOffset>0x15c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_ANA_TOUCH_PAD2_TH0</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_TOUCH_PAD2_TH1</name>
          <description>need_des</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_ANA_TOUCH_PAD2_TH1</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_TOUCH_PAD2_TH2</name>
          <description>need_des</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_ANA_TOUCH_PAD2_TH2</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_TOUCH_PAD3_TH0</name>
          <description>need_des</description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_ANA_TOUCH_PAD3_TH0</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
