esp-rs/esp-pacs/esp32p4-lp/svd/esp32p4-lp.base.svd
        <register>
          <name>PIN13</name>
          <description>Reserved</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_GPIO_PIN13_WAKEUP_ENABLE</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_PIN13_INT_TYPE</name>
              <description>Reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_PIN13_PAD_DRIVER</name>
              <description>Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPI13_PIN0_EDGE_WAKEUP_CLR</name>
              <description>need des</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIN14</name>
          <description>Reserved</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_GPIO_PIN14_WAKEUP_ENABLE</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_PIN14_INT_TYPE</name>
              <description>Reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_PIN14_PAD_DRIVER</name>
              <description>Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPI14_PIN0_EDGE_WAKEUP_CLR</name>
              <description>need des</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIN15</name>
          <description>Reserved</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_GPIO_PIN15_WAKEUP_ENABLE</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_PIN15_INT_TYPE</name>
              <description>Reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_PIN15_PAD_DRIVER</name>
              <description>Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPI15_PIN0_EDGE_WAKEUP_CLR</name>
              <description>need des</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC0_IN_SEL_CFG</name>
          <description>Reserved</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0xc0</resetValue>
          <fields>
            <field>
              <name>REG_GPIO_FUNC0_IN_INV_SEL</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_SIG0_IN_SEL</name>
              <description>Reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_FUNC0_IN_SEL</name>
              <description>reg_gpio_func0_in_sel[5:4]==2'b11-&gt;constant 1,reg_gpio_func0_in_sel[5:4]==2'b10-&gt;constant 0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC1_IN_SEL_CFG</name>
          <description>Reserved</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0xc0</resetValue>
          <fields>
            <field>
              <name>REG_GPIO_FUNC1_IN_INV_SEL</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_SIG1_IN_SEL</name>
              <description>Reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_FUNC1_IN_SEL</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC2_IN_SEL_CFG</name>
          <description>Reserved</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0x80</resetValue>
          <fields>
            <field>
              <name>REG_GPIO_FUNC2_IN_INV_SEL</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_SIG2_IN_SEL</name>
              <description>Reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_FUNC2_IN_SEL</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC3_IN_SEL_CFG</name>
          <description>Reserved</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0xc0</resetValue>
          <fields>
            <field>
              <name>REG_GPIO_FUNC3_IN_INV_SEL</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_SIG3_IN_SEL</name>
              <description>Reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_FUNC3_IN_SEL</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC4_IN_SEL_CFG</name>
          <description>Reserved</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0xc0</resetValue>
          <fields>
            <field>
              <name>REG_GPIO_FUNC4_IN_INV_SEL</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_SIG4_IN_SEL</name>
              <description>Reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_FUNC4_IN_SEL</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC5_IN_SEL_CFG</name>
          <description>Reserved</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0x80</resetValue>
          <fields>
            <field>
              <name>REG_GPIO_FUNC5_IN_INV_SEL</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_SIG5_IN_SEL</name>
              <description>Reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_FUNC5_IN_SEL</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC6_IN_SEL_CFG</name>
          <description>Reserved</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0x80</resetValue>
          <fields>
            <field>
              <name>REG_GPIO_FUNC6_IN_INV_SEL</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_SIG6_IN_SEL</name>
              <description>Reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_FUNC6_IN_SEL</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC7_IN_SEL_CFG</name>
          <description>Reserved</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0x80</resetValue>
          <fields>
            <field>
              <name>REG_GPIO_FUNC7_IN_INV_SEL</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_SIG7_IN_SEL</name>
              <description>Reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_FUNC7_IN_SEL</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC8_IN_SEL_CFG</name>
          <description>Reserved</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0x80</resetValue>
          <fields>
            <field>
              <name>REG_GPIO_FUNC8_IN_INV_SEL</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_SIG8_IN_SEL</name>
              <description>Reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_FUNC8_IN_SEL</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC9_IN_SEL_CFG</name>
          <description>Reserved</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0x80</resetValue>
          <fields>
            <field>
              <name>REG_GPIO_FUNC9_IN_INV_SEL</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_SIG9_IN_SEL</name>
              <description>Reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_FUNC9_IN_SEL</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC10_IN_SEL_CFG</name>
          <description>Reserved</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0x80</resetValue>
          <fields>
            <field>
              <name>REG_GPIO_FUNC10_IN_INV_SEL</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_SIG10_IN_SEL</name>
              <description>Reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_FUNC10_IN_SEL</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC11_IN_SEL_CFG</name>
          <description>Reserved</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0x80</resetValue>
          <fields>
            <field>
              <name>REG_GPIO_FUNC11_IN_INV_SEL</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_SIG11_IN_SEL</name>
              <description>Reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_FUNC11_IN_SEL</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC12_IN_SEL_CFG</name>
          <description>Reserved</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <resetValue>0x80</resetValue>
          <fields>
            <field>
              <name>REG_GPIO_FUNC12_IN_INV_SEL</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_SIG12_IN_SEL</name>
              <description>Reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_FUNC12_IN_SEL</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC13_IN_SEL_CFG</name>
          <description>Reserved</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <resetValue>0x80</resetValue>
          <fields>
            <field>
              <name>REG_GPIO_FUNC13_IN_INV_SEL</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_SIG13_IN_SEL</name>
              <description>Reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_FUNC13_IN_SEL</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC0_OUT_SEL_CFG</name>
          <description>Reserved</description>
          <addressOffset>0xf4</addressOffset>
          <size>32</size>
          <resetValue>0x100</resetValue>
          <fields>
            <field>
              <name>REG_GPIO_FUNC0_OE_INV_SEL</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_FUNC0_OE_SEL</name>
              <description>Reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_FUNC0_OUT_INV_SEL</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_FUNC0_OUT_SEL</name>
              <description>reg_gpio_func0_out_sel[5:1]==16 -&gt; output gpio register value to pad</description>
              <bitOffset>3</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC1_OUT_SEL_CFG</name>
          <description>Reserved</description>
          <addressOffset>0xf8</addressOffset>
          <size>32</size>
          <resetValue>0x100</resetValue>
          <fields>
            <field>
              <name>REG_GPIO_FUNC1_OE_INV_SEL</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_FUNC1_OE_SEL</name>
              <description>Reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_FUNC1_OUT_INV_SEL</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_FUNC1_OUT_SEL</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC2_OUT_SEL_CFG</name>
          <description>Reserved</description>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <resetValue>0x100</resetValue>
          <fields>
            <field>
              <name>REG_GPIO_FUNC2_OE_INV_SEL</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_FUNC2_OE_SEL</name>
              <description>Reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_FUNC2_OUT_INV_SEL</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_GPIO_FUNC2_OUT_SEL</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
