esp-rs/esp-pacs/esp32p4-lp/svd/esp32p4-lp.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LP_HUK</name>
      <description>LP_HUK Peripheral</description>
      <groupName>HUK</groupName>
      <baseAddress>0x50114000</baseAddress>
      <interrupt>
        <name>LP_EFUSE</name>
        <description>LP eFuse / HUK interrupt</description>
        <value>21</value>
      </interrupt>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1a8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CLK</name>
          <description>HUK Generator clock gate control register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>Write 1 to force on register clock gate.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_CG_FORCE_ON</name>
              <description>Write 1 to force on memory clock gate.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>HUK Generator interrupt raw register, valid in level.</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PREP_DONE_INT_RAW</name>
              <description>The raw interrupt status bit  for the huk_prep_done_int interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PROC_DONE_INT_RAW</name>
              <description>The raw interrupt status bit  for the huk_proc_done_int interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>POST_DONE_INT_RAW</name>
              <description>The raw interrupt status bit  for the huk_post_done_int interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>HUK Generator interrupt status register.</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PREP_DONE_INT_ST</name>
              <description>The masked interrupt status bit  for the huk_prep_done_int interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PROC_DONE_INT_ST</name>
              <description>The masked interrupt status bit  for the huk_proc_done_int interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>POST_DONE_INT_ST</name>
              <description>The masked interrupt status bit  for the huk_post_done_int interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>HUK Generator interrupt enable register.</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PREP_DONE_INT_ENA</name>
              <description>The interrupt enable bit  for the huk_prep_done_int interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PROC_DONE_INT_ENA</name>
              <description>The interrupt enable bit  for the huk_proc_done_int interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POST_DONE_INT_ENA</name>
              <description>The interrupt enable bit  for the huk_post_done_int interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>HUK Generator interrupt clear register.</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PREP_DONE_INT_CLR</name>
              <description>Set this bit to clear the huk_prep_done_int interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PROC_DONE_INT_CLR</name>
              <description>Set this bit to clear the huk_proc_done_int interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>POST_DONE_INT_CLR</name>
              <description>Set this bit to clear the huk_post_done_int interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF</name>
          <description>HUK Generator configuration register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MODE</name>
              <description>Set this field to choose the huk process. 1: process huk generate mode. 0: process huk recovery mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>START</name>
          <description>HUK Generator control register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>START</name>
              <description>Write 1 to continue HUK Generator operation at LOAD/GAIN state.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CONTINUE</name>
              <description>Write 1 to start HUK Generator at IDLE state.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATE</name>
          <description>HUK Generator state register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STATE</name>
              <description>The state of HUK Generator. 0: IDLE. 1: LOAD. 2: GAIN. 3: BUSY.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>HUK Generator HUK status register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STATUS</name>
              <description>The HUK generation status. 0: HUK is not generated. 1: HUK is generated and valid. 2: HUK is generated but invalid. 3: reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RISK_LEVEL</name>
              <description>The risk level of HUK. 0-6: the higher the risk level is, the more error bits there are in the PUF SRAM. 7: Error Level, HUK is invalid.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <resetValue>0x2305040</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>HUK Generator version control register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>384</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>INFO_MEM[%s]</name>
          <description>The memory that stores HUK info.</description>
          <addressOffset>0x100</addressOffset>
          <size>8</size>
        </register>
