esp-rs/esp-pacs/esp32p4-lp/svd/esp32p4-lp.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LP_I2S0</name>
      <description>Low-power I2S (Inter-IC Sound) Controller 0</description>
      <groupName>LP_I2S</groupName>
      <baseAddress>0x50125000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x98</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>VAD_CONF</name>
          <description>I2S VAD Configure register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VAD_EN</name>
              <description>VAD enable register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VAD_RESET</name>
              <description>VAD reset register</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>VAD_FORCE_START</name>
              <description>VAD force start register.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VAD_RESULT</name>
          <description>I2S VAD Result register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VAD_FLAG</name>
              <description>Reg vad flag observe signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENERGY_ENOUGH</name>
              <description>Reg energy enough observe signal</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_MEM_CONF</name>
          <description>I2S VAD Observe register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0x7e00</resetValue>
          <fields>
            <field>
              <name>RX_MEM_FIFO_CNT</name>
              <description>The number of data in the rx mem</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_MEM_THRESHOLD</name>
              <description>I2S rx mem will trigger an interrupt when the data in the mem is over(not including equal) reg_rx_mem_threshold</description>
              <bitOffset>9</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>I2S interrupt raw register, valid in level.</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RX_DONE_INT_RAW</name>
              <description>The raw interrupt status bit  for the i2s_rx_done_int interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_HUNG_INT_RAW</name>
              <description>The raw interrupt status bit  for the i2s_rx_hung_int interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_FIFOMEM_UDF_INT_RAW</name>
              <description>The raw interrupt status bit  for the i2s_rx_fifomem_udf_int interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VAD_DONE_INT_RAW</name>
              <description>The raw interrupt status bit  for the vad_done_int interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VAD_RESET_DONE_INT_RAW</name>
              <description>The raw interrupt status bit  for the vad_reset_done_int interrupt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_MEM_THRESHOLD_INT_RAW</name>
              <description>The raw interrupt status bit  for the rx_mem_threshold_int interrupt</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>I2S interrupt status register.</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RX_DONE_INT_ST</name>
              <description>The masked interrupt status bit  for the i2s_rx_done_int interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_HUNG_INT_ST</name>
              <description>The masked interrupt status bit  for the i2s_rx_hung_int interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_FIFOMEM_UDF_INT_ST</name>
              <description>The masked interrupt status bit  for the i2s_rx_fifomem_udf_int interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_VAD_DONE_INT_ST</name>
              <description>The masked interrupt status bit  for the vad_done_int interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_VAD_RESET_DONE_INT_ST</name>
              <description>The masked interrupt status bit  for the vad_reset_done_int interrupt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_MEM_THRESHOLD_INT_ST</name>
              <description>The masked interrupt status bit  for the rx_mem_threshold_int interrupt</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>I2S interrupt enable register.</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RX_DONE_INT_ENA</name>
              <description>The interrupt enable bit  for the i2s_rx_done_int interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_HUNG_INT_ENA</name>
              <description>The interrupt enable bit  for the i2s_rx_hung_int interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_FIFOMEM_UDF_INT_ENA</name>
              <description>The interrupt enable bit  for the i2s_rx_fifomem_udf_int interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_VAD_DONE_INT_ENA</name>
              <description>The interrupt enable bit  for the vad_done_int interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_VAD_RESET_DONE_INT_ENA</name>
              <description>The interrupt enable bit  for the vad_reset_done_int interrupt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_MEM_THRESHOLD_INT_ENA</name>
              <description>The interrupt enable bit  for the rx_mem_threshold_int interrupt</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>I2S interrupt clear register.</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RX_DONE_INT_CLR</name>
              <description>Set this bit to clear the i2s_rx_done_int interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RX_HUNG_INT_CLR</name>
              <description>Set this bit to clear the i2s_rx_hung_int interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RX_FIFOMEM_UDF_INT_CLR</name>
              <description>Set this bit to clear the i2s_rx_fifomem_udf_int interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_VAD_DONE_INT_CLR</name>
              <description>Set this bit to clear the vad_done_int interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_VAD_RESET_DONE_INT_CLR</name>
              <description>Set this bit to clear the vad_reset_done_int interrupt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RX_MEM_THRESHOLD_INT_CLR</name>
              <description>Set this bit to clear the rx_mem_threshold_int interrupt</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CONF</name>
          <description>I2S RX configure register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0x9600</resetValue>
          <fields>
            <field>
              <name>RX_RESET</name>
              <description>Set this bit to reset receiver</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RX_FIFO_RESET</name>
              <description>Set this bit to reset Rx AFIFO</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RX_START</name>
              <description>Set this bit to start receiving data</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_SLAVE_MOD</name>
              <description>Set this bit to enable slave receiver mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_FIFOMEM_RESET</name>
              <description>Set this bit to reset Rx Syncfifomem</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RX_MONO</name>
              <description>Set this bit to enable receiver  in mono mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_BIG_ENDIAN</name>
              <description>I2S Rx byte endian, 1: low addr value to high addr. 0: low addr with low addr value.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_UPDATE</name>
              <description>Set 1 to update I2S RX registers from APB clock domain to I2S RX clock domain. This bit will be cleared by hardware after update register done.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_MONO_FST_VLD</name>
              <description>1: The first channel data value is valid in I2S RX mono mode.   0: The second channel data value is valid in I2S RX mono mode.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_PCM_CONF</name>
              <description>I2S RX compress/decompress configuration bit. &amp; 0 (atol): A-Law decompress, 1 (ltoa) : A-Law compress, 2 (utol) : u-Law decompress, 3 (ltou) : u-Law compress. &amp;</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_PCM_BYPASS</name>
              <description>Set this bit to bypass Compress/Decompress module for received data.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_STOP_MODE</name>
              <description>0  : I2S Rx only stop when reg_rx_start is cleared.   1: Stop when reg_rx_start is 0 or in_suc_eof is 1.   2:  Stop I2S RX when reg_rx_start is 0 or RX FIFO is full.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_LEFT_ALIGN</name>
              <description>1: I2S RX left alignment mode. 0: I2S RX right alignment mode.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_24_FILL_EN</name>
              <description>1: store 24 channel bits to 32 bits. 0:store 24 channel bits to 24 bits.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_WS_IDLE_POL</name>
              <description>0: WS should be 0 when receiving left channel data, and WS is 1in right channel.  1: WS should be 1 when receiving left channel data, and WS is 0in right channel.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_BIT_ORDER</name>
              <description>I2S Rx bit endian. 1:small endian, the LSB is received first. 0:big endian, the MSB is received first.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_TDM_EN</name>
              <description>1: Enable I2S TDM Rx mode . 0: Disable.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_PDM_EN</name>
              <description>1: Enable I2S PDM Rx mode . 0: Disable.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CONF1</name>
          <description>I2S RX configure register 1</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0x2f3de300</resetValue>
          <fields>
            <field>
              <name>RX_TDM_WS_WIDTH</name>
              <description>The width of rx_ws_out in TDM mode is (I2S_RX_TDM_WS_WIDTH[6:0] +1) * T_bck</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_BCK_DIV_NUM</name>
              <description>Bit clock configuration bits in receiver mode.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_BITS_MOD</name>
              <description>Set the bits to configure the valid data bit length of I2S receiver channel. 7: all the valid channel data is in 8-bit-mode. 15: all the valid channel data is in 16-bit-mode. 23: all the valid channel data is in 24-bit-mode. 31:all the valid channel data is in 32-bit-mode.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_HALF_SAMPLE_BITS</name>
              <description>I2S Rx half sample bits -1.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_TDM_CHAN_BITS</name>
              <description>The Rx bit number for each channel minus 1in TDM mode.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_MSB_SHIFT</name>
              <description>Set this bit to enable receiver in Phillips standard mode</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_TDM_CTRL</name>
          <description>I2S TX TDM mode control register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0x3</resetValue>
          <fields>
            <field>
              <name>RX_TDM_PDM_CHAN0_EN</name>
              <description>1: Enable the valid data input of I2S RX TDM or PDM channel 0. 0:  Disable, just input 0 in this channel.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_TDM_PDM_CHAN1_EN</name>
              <description>1: Enable the valid data input of I2S RX TDM or PDM channel 1. 0:  Disable, just input 0 in this channel.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_TDM_TOT_CHAN_NUM</name>
              <description>The total channel number of I2S TX TDM mode.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_TIMING</name>
          <description>I2S RX timing control register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RX_SD_IN_DM</name>
              <description>The delay mode of I2S Rx SD input signal. 0: bypass. 1: delay by pos edge.  2: delay by neg edge. 3: not used.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_WS_OUT_DM</name>
              <description>The delay mode of I2S Rx WS output signal. 0: bypass. 1: delay by pos edge.  2: delay by neg edge. 3: not used.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_BCK_OUT_DM</name>
              <description>The delay mode of I2S Rx BCK output signal. 0: bypass. 1: delay by pos edge.  2: delay by neg edge. 3: not used.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_WS_IN_DM</name>
              <description>The delay mode of I2S Rx WS input signal. 0: bypass. 1: delay by pos edge.  2: delay by neg edge. 3: not used.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_BCK_IN_DM</name>
              <description>The delay mode of I2S Rx BCK input signal. 0: bypass. 1: delay by pos edge.  2: delay by neg edge. 3: not used.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
