esp-rs/esp-pacs/esp32p4-lp/svd/esp32p4-lp.base.svd
        <register>
          <name>LC_HUNG_CONF</name>
          <description>I2S HUNG configure register.</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0x810</resetValue>
          <fields>
            <field>
              <name>LC_FIFO_TIMEOUT</name>
              <description>the i2s_tx_hung_int interrupt or the i2s_rx_hung_int interrupt will be triggered when fifo hung counter is equal to this value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LC_FIFO_TIMEOUT_SHIFT</name>
              <description>The bits are used to scale tick counter threshold. The tick counter is reset when counter value &gt;= 88000/2^i2s_lc_fifo_timeout_shift</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LC_FIFO_TIMEOUT_ENA</name>
              <description>The enable bit for FIFO timeout</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXEOF_NUM</name>
          <description>I2S RX data number control register.</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0x40</resetValue>
          <fields>
            <field>
              <name>RX_EOF_NUM</name>
              <description>The receive data bit length is (I2S_RX_BITS_MOD[4:0] + 1) * (REG_RX_EOF_NUM[11:0] + 1) . It will trigger in_suc_eof interrupt in the configured DMA RX channel.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF_SIGLE_DATA</name>
          <description>I2S signal data register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SINGLE_DATA</name>
              <description>The configured constant channel data to be sent out.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_PDM_CONF</name>
          <description>I2S RX configure register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0xf8200000</resetValue>
          <fields>
            <field>
              <name>RX_PDM2PCM_EN</name>
              <description>1: Enable PDM2PCM RX mode. 0: DIsable.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_PDM_SINC_DSR_16_EN</name>
              <description>Configure the down sampling rate of PDM RX filter group1 module. 1: The  down sampling rate is 128. 0: down sampling rate is 64.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_PDM2PCM_AMPLIFY_NUM</name>
              <description>Configure PDM RX amplify number.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_PDM_HP_BYPASS</name>
              <description>I2S PDM RX bypass hp filter or not.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_IIR_HP_MULT12_5</name>
              <description>The fourth parameter of PDM RX IIR_HP filter stage 2 is (504 + LP_I2S_RX_IIR_HP_MULT12_5[2:0])</description>
              <bitOffset>26</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_IIR_HP_MULT12_0</name>
              <description>The fourth parameter of PDM RX IIR_HP filter stage 1 is (504 + LP_I2S_RX_IIR_HP_MULT12_0[2:0])</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECO_LOW</name>
          <description>I2S ECO register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RDN_ECO_LOW</name>
              <description>logic low eco registers</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECO_HIGH</name>
          <description>I2S ECO register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>RDN_ECO_HIGH</name>
              <description>logic high eco registers</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECO_CONF</name>
          <description>I2S ECO register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RDN_ENA</name>
              <description>enable rdn counter bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDN_RESULT</name>
              <description>rdn result</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VAD_PARAM0</name>
          <description>I2S VAD Parameter register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0xc81388</resetValue>
          <fields>
            <field>
              <name>PARAM_MIN_ENERGY</name>
              <description>VAD parameter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARAM_INIT_FRAME_NUM</name>
              <description>VAD parameter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VAD_PARAM1</name>
          <description>I2S VAD Parameter register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0x281e1e43</resetValue>
          <fields>
            <field>
              <name>PARAM_MIN_SPEECH_COUNT</name>
              <description>VAD parameter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARAM_MAX_SPEECH_COUNT</name>
              <description>VAD parameter</description>
              <bitOffset>4</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARAM_HANGOVER_SPEECH</name>
              <description>VAD parameter</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARAM_HANGOVER_SILENT</name>
              <description>VAD parameter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARAM_MAX_OFFSET</name>
              <description>VAD parameter</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARAM_SKIP_BAND_ENERGY</name>
              <description>Set 1 to skip band energy check.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VAD_PARAM2</name>
          <description>I2S VAD Parameter register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0x7eb86666</resetValue>
          <fields>
            <field>
              <name>PARAM_NOISE_AMP_DOWN</name>
              <description>VAD parameter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARAM_NOISE_AMP_UP</name>
              <description>VAD parameter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VAD_PARAM3</name>
          <description>I2S VAD Parameter register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0x7d717fdf</resetValue>
          <fields>
            <field>
              <name>PARAM_NOISE_SPE_UP0</name>
              <description>VAD parameter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARAM_NOISE_SPE_UP1</name>
              <description>VAD parameter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VAD_PARAM4</name>
          <description>I2S VAD Parameter register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0x799a6666</resetValue>
          <fields>
            <field>
              <name>PARAM_NOISE_SPE_DOWN</name>
              <description>VAD parameter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARAM_NOISE_MEAN_DOWN</name>
              <description>VAD parameter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VAD_PARAM5</name>
          <description>I2S VAD Parameter register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0x7c287d71</resetValue>
          <fields>
            <field>
              <name>PARAM_NOISE_MEAN_UP0</name>
              <description>VAD parameter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARAM_NOISE_MEAN_UP1</name>
              <description>VAD parameter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VAD_PARAM6</name>
          <description>I2S VAD Parameter register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0xb4007d00</resetValue>
          <fields>
            <field>
              <name>PARAM_NOISE_STD_FS_THSL</name>
              <description>Feature_sum threshold to determine noise_std max value when vad_tag=1, equal to ((noise_std_max)&gt;&gt;11)^2*5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARAM_NOISE_STD_FS_THSH</name>
              <description>Feature_sum threshold to determine noise_std max value when vad_tag=0, equal to ((noise_std_max)&gt;&gt;11)^2*5</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VAD_PARAM7</name>
          <description>I2S VAD Parameter register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0x1487eb8</resetValue>
          <fields>
            <field>
              <name>PARAM_THRES_UPD_BASE</name>
              <description>VAD parameter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARAM_THRES_UPD_VARY</name>
              <description>VAD parameter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VAD_PARAM8</name>
          <description>I2S VAD Parameter register</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0x20005040</resetValue>
          <fields>
            <field>
              <name>PARAM_THRES_UPD_BDL</name>
              <description>Noise_std boundary low when updating threshold.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARAM_THRES_UPD_BDH</name>
              <description>Noise_std boundary high when updating threshold.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARAM_FEATURE_BURST</name>
              <description>VAD parameter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VAD_OB0</name>
          <description>I2S VAD Observe register</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPEECH_COUNT_OB</name>
              <description>Reg silent count observe</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SILENT_COUNT_OB</name>
              <description>Reg speech count observe</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAX_SIGNAL0_OB</name>
              <description>Reg max signal0 observe</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VAD_OB1</name>
          <description>I2S VAD Observe register</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MAX_SIGNAL1_OB</name>
              <description>Reg max signal1 observe</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAX_SIGNAL2_OB</name>
              <description>Reg max signal2 observe</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VAD_OB2</name>
          <description>I2S VAD Observe register</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NOISE_AMP_OB</name>
              <description>Reg noise_amp observe signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VAD_OB3</name>
          <description>I2S VAD Observe register</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NOISE_MEAN_OB</name>
              <description>Reg noise_mean observe signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VAD_OB4</name>
          <description>I2S VAD Observe register</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NOISE_STD_OB</name>
              <description>Reg noise_std observe signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VAD_OB5</name>
          <description>I2S VAD Observe register</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OFFSET_OB</name>
              <description>Reg offset observe signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VAD_OB6</name>
          <description>I2S VAD Observe register</description>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>THRESHOLD_OB</name>
              <description>Reg threshold observe signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VAD_OB7</name>
          <description>I2S VAD Observe register</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ENERGY_LOW_OB</name>
              <description>Reg energy bit 31~0 observe signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VAD_OB8</name>
          <description>I2S VAD Observe register</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ENERGY_HIGH_OB</name>
              <description>Reg energy bit 63~32 observe signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_GATE</name>
          <description>Clock gate register</description>
          <addressOffset>0xf8</addressOffset>
          <size>32</size>
          <resetValue>0xa</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>set this bit to enable clock gate</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VAD_CG_FORCE_ON</name>
              <description>VAD clock gate force on register</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_MEM_CG_FORCE_ON</name>
              <description>I2S rx mem clock gate force on register</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_REG_CG_FORCE_ON</name>
              <description>I2S rx reg clock gate force on register</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <resetValue>0x2305040</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>I2S version control register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
