esp-rs/esp-pacs/esp32p4-lp/svd/esp32p4-lp.base.svd
        <register>
          <name>PAD15</name>
          <description>Reserved</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>REG_PAD15_DRV</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PAD15_RDE</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PAD15_RUE</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PAD15_MUX_SEL</name>
              <description>1:use LP GPIO,0: use digital GPIO</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PAD15_FUN_SEL</name>
              <description>function sel</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PAD15_SLP_SEL</name>
              <description>1: enable sleep mode during sleep,0: no sleep mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PAD15_SLP_IE</name>
              <description>input enable in sleep mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PAD15_SLP_OE</name>
              <description>output enable in sleep mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PAD15_FUN_IE</name>
              <description>input enable in work mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PAD15_FILTER_EN</name>
              <description>need des</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXT_WAKEUP0_SEL</name>
          <description>Reserved</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_XTL_EXT_CTR_SEL</name>
              <description>select LP GPIO 0 ~ 15 to control XTAL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_EXT_WAKEUP0_SEL</name>
              <description>Reserved</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_PAD_HOLD</name>
          <description>Reserved</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_LP_GPIO_HOLD</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_PAD_HYS</name>
          <description>Reserved</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_LP_GPIO_HYS</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>LP_MAILBOX</name>
      <description>LP_MAILBOX</description>
      <groupName>LP_MAILBOX</groupName>
      <baseAddress>0x50118000</baseAddress>
      <interrupt>
        <name>LP_MAILBOX</name>
        <description>LP mailbox interrupt</description>
        <value>25</value>
      </interrupt>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000320</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MB_MESSAGE_%s</name>
          <dim>16</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
          <addressOffset>0x0</addressOffset>
          <description>MB_MASSEGE_0</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MB_MESSAGE_0</name>
              <description>MB_MASSEGE_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MB_LP_INT_RAW</name>
          <addressOffset>0x40</addressOffset>
          <description>MB_LP_INT_RAW</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MB_LP_0_INT_RAW</name>
              <description>MB_LP_0_INT_RAW</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_LP_1_INT_RAW</name>
              <description>MB_LP_1_INT_RAW</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_LP_2_INT_RAW</name>
              <description>MB_LP_2_INT_RAW</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_LP_3_INT_RAW</name>
              <description>MB_LP_3_INT_RAW</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_LP_4_INT_RAW</name>
              <description>MB_LP_4_INT_RAW</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_LP_5_INT_RAW</name>
              <description>MB_LP_5_INT_RAW</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_LP_6_INT_RAW</name>
              <description>MB_LP_6_INT_RAW</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_LP_7_INT_RAW</name>
              <description>MB_LP_7_INT_RAW</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_LP_8_INT_RAW</name>
              <description>MB_LP_8_INT_RAW</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_LP_9_INT_RAW</name>
              <description>MB_LP_9_INT_RAW</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_LP_10_INT_RAW</name>
              <description>MB_LP_10_INT_RAW</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_LP_11_INT_RAW</name>
              <description>MB_LP_11_INT_RAW</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_LP_12_INT_RAW</name>
              <description>MB_LP_12_INT_RAW</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_LP_13_INT_RAW</name>
              <description>MB_LP_13_INT_RAW</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_LP_14_INT_RAW</name>
              <description>MB_LP_14_INT_RAW</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_LP_15_INT_RAW</name>
              <description>MB_LP_15_INT_RAW</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MB_LP_INT_ST</name>
          <addressOffset>0x44</addressOffset>
          <description>MB_LP_INT_ST</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MB_LP_0_INT_ST</name>
              <description>MB_LP_0_INT_ST</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_LP_1_INT_ST</name>
              <description>MB_LP_1_INT_ST</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_LP_2_INT_ST</name>
              <description>MB_LP_2_INT_ST</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_LP_3_INT_ST</name>
              <description>MB_LP_3_INT_ST</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_LP_4_INT_ST</name>
              <description>MB_LP_4_INT_ST</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_LP_5_INT_ST</name>
              <description>MB_LP_5_INT_ST</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_LP_6_INT_ST</name>
              <description>MB_LP_6_INT_ST</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_LP_7_INT_ST</name>
              <description>MB_LP_7_INT_ST</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_LP_8_INT_ST</name>
              <description>MB_LP_8_INT_ST</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_LP_9_INT_ST</name>
              <description>MB_LP_9_INT_ST</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_LP_10_INT_ST</name>
              <description>MB_LP_10_INT_ST</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_LP_11_INT_ST</name>
              <description>MB_LP_11_INT_ST</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_LP_12_INT_ST</name>
              <description>MB_LP_12_INT_ST</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_LP_13_INT_ST</name>
              <description>MB_LP_13_INT_ST</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_LP_14_INT_ST</name>
              <description>MB_LP_14_INT_ST</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_LP_15_INT_ST</name>
              <description>MB_LP_15_INT_ST</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MB_LP_INT_ENA</name>
          <addressOffset>0x48</addressOffset>
          <description>MB_LP_INT_ENA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MB_LP_0_INT_ENA</name>
              <description>MB_LP_0_INT_ENA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MB_LP_1_INT_ENA</name>
              <description>MB_LP_1_INT_ENA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MB_LP_2_INT_ENA</name>
              <description>MB_LP_2_INT_ENA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MB_LP_3_INT_ENA</name>
              <description>MB_LP_3_INT_ENA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MB_LP_4_INT_ENA</name>
              <description>MB_LP_4_INT_ENA</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MB_LP_5_INT_ENA</name>
              <description>MB_LP_5_INT_ENA</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MB_LP_6_INT_ENA</name>
              <description>MB_LP_6_INT_ENA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MB_LP_7_INT_ENA</name>
              <description>MB_LP_7_INT_ENA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MB_LP_8_INT_ENA</name>
              <description>MB_LP_8_INT_ENA</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MB_LP_9_INT_ENA</name>
              <description>MB_LP_9_INT_ENA</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MB_LP_10_INT_ENA</name>
              <description>MB_LP_10_INT_ENA</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MB_LP_11_INT_ENA</name>
              <description>MB_LP_11_INT_ENA</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MB_LP_12_INT_ENA</name>
              <description>MB_LP_12_INT_ENA</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MB_LP_13_INT_ENA</name>
              <description>MB_LP_13_INT_ENA</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MB_LP_14_INT_ENA</name>
              <description>MB_LP_14_INT_ENA</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MB_LP_15_INT_ENA</name>
              <description>MB_LP_15_INT_ENA</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MB_LP_INT_CLR</name>
          <addressOffset>0x4c</addressOffset>
          <description>MB_LP_INT_CLR</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MB_LP_0_INT_CLR</name>
              <description>MB_LP_0_INT_CLR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MB_LP_1_INT_CLR</name>
              <description>MB_LP_1_INT_CLR</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MB_LP_2_INT_CLR</name>
              <description>MB_LP_2_INT_CLR</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MB_LP_3_INT_CLR</name>
              <description>MB_LP_3_INT_CLR</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MB_LP_4_INT_CLR</name>
              <description>MB_LP_4_INT_CLR</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MB_LP_5_INT_CLR</name>
              <description>MB_LP_5_INT_CLR</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MB_LP_6_INT_CLR</name>
              <description>MB_LP_6_INT_CLR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MB_LP_7_INT_CLR</name>
              <description>MB_LP_7_INT_CLR</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MB_LP_8_INT_CLR</name>
              <description>MB_LP_8_INT_CLR</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MB_LP_9_INT_CLR</name>
              <description>MB_LP_9_INT_CLR</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MB_LP_10_INT_CLR</name>
              <description>MB_LP_10_INT_CLR</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MB_LP_11_INT_CLR</name>
              <description>MB_LP_11_INT_CLR</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MB_LP_12_INT_CLR</name>
              <description>MB_LP_12_INT_CLR</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MB_LP_13_INT_CLR</name>
              <description>MB_LP_13_INT_CLR</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MB_LP_14_INT_CLR</name>
              <description>MB_LP_14_INT_CLR</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MB_LP_15_INT_CLR</name>
              <description>MB_LP_15_INT_CLR</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
