esp-rs/esp-pacs/esp32p4-lp/svd/esp32p4-lp.base.svd
        <register>
          <name>MB_HP_INT_RAW</name>
          <addressOffset>0x50</addressOffset>
          <description>MB_HP_INT_RAW</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MB_HP_0_INT_RAW</name>
              <description>MB_HP_0_INT_RAW</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_HP_1_INT_RAW</name>
              <description>MB_HP_1_INT_RAW</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_HP_2_INT_RAW</name>
              <description>MB_HP_2_INT_RAW</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_HP_3_INT_RAW</name>
              <description>MB_HP_3_INT_RAW</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_HP_4_INT_RAW</name>
              <description>MB_HP_4_INT_RAW</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_HP_5_INT_RAW</name>
              <description>MB_HP_5_INT_RAW</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_HP_6_INT_RAW</name>
              <description>MB_HP_6_INT_RAW</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_HP_7_INT_RAW</name>
              <description>MB_HP_7_INT_RAW</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_HP_8_INT_RAW</name>
              <description>MB_HP_8_INT_RAW</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_HP_9_INT_RAW</name>
              <description>MB_HP_9_INT_RAW</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_HP_10_INT_RAW</name>
              <description>MB_HP_10_INT_RAW</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_HP_11_INT_RAW</name>
              <description>MB_HP_11_INT_RAW</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_HP_12_INT_RAW</name>
              <description>MB_HP_12_INT_RAW</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_HP_13_INT_RAW</name>
              <description>MB_HP_13_INT_RAW</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_HP_14_INT_RAW</name>
              <description>MB_HP_14_INT_RAW</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_HP_15_INT_RAW</name>
              <description>MB_HP_15_INT_RAW</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MB_HP_INT_ST</name>
          <addressOffset>0x54</addressOffset>
          <description>MB_HP_INT_ST</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MB_HP_0_INT_ST</name>
              <description>MB_HP_0_INT_ST</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_HP_1_INT_ST</name>
              <description>MB_HP_1_INT_ST</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_HP_2_INT_ST</name>
              <description>MB_HP_2_INT_ST</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_HP_3_INT_ST</name>
              <description>MB_HP_3_INT_ST</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_HP_4_INT_ST</name>
              <description>MB_HP_4_INT_ST</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_HP_5_INT_ST</name>
              <description>MB_HP_5_INT_ST</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_HP_6_INT_ST</name>
              <description>MB_HP_6_INT_ST</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_HP_7_INT_ST</name>
              <description>MB_HP_7_INT_ST</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_HP_8_INT_ST</name>
              <description>MB_HP_8_INT_ST</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_HP_9_INT_ST</name>
              <description>MB_HP_9_INT_ST</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_HP_10_INT_ST</name>
              <description>MB_HP_10_INT_ST</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_HP_11_INT_ST</name>
              <description>MB_HP_11_INT_ST</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_HP_12_INT_ST</name>
              <description>MB_HP_12_INT_ST</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_HP_13_INT_ST</name>
              <description>MB_HP_13_INT_ST</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_HP_14_INT_ST</name>
              <description>MB_HP_14_INT_ST</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB_HP_15_INT_ST</name>
              <description>MB_HP_15_INT_ST</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MB_HP_INT_ENA</name>
          <addressOffset>0x58</addressOffset>
          <description>MB_HP_INT_ENA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MB_HP_0_INT_ENA</name>
              <description>MB_HP_0_INT_ENA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MB_HP_1_INT_ENA</name>
              <description>MB_HP_1_INT_ENA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MB_HP_2_INT_ENA</name>
              <description>MB_HP_2_INT_ENA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MB_HP_3_INT_ENA</name>
              <description>MB_HP_3_INT_ENA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MB_HP_4_INT_ENA</name>
              <description>MB_HP_4_INT_ENA</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MB_HP_5_INT_ENA</name>
              <description>MB_HP_5_INT_ENA</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MB_HP_6_INT_ENA</name>
              <description>MB_HP_6_INT_ENA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MB_HP_7_INT_ENA</name>
              <description>MB_HP_7_INT_ENA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MB_HP_8_INT_ENA</name>
              <description>MB_HP_8_INT_ENA</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MB_HP_9_INT_ENA</name>
              <description>MB_HP_9_INT_ENA</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MB_HP_10_INT_ENA</name>
              <description>MB_HP_10_INT_ENA</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MB_HP_11_INT_ENA</name>
              <description>MB_HP_11_INT_ENA</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MB_HP_12_INT_ENA</name>
              <description>MB_HP_12_INT_ENA</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MB_HP_13_INT_ENA</name>
              <description>MB_HP_13_INT_ENA</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MB_HP_14_INT_ENA</name>
              <description>MB_HP_14_INT_ENA</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MB_HP_15_INT_ENA</name>
              <description>MB_HP_15_INT_ENA</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MB_HP_INT_CLR</name>
          <addressOffset>0x5c</addressOffset>
          <description>MB_HP_INT_CLR</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MB_HP_0_INT_CLR</name>
              <description>MB_HP_0_INT_CLR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MB_HP_1_INT_CLR</name>
              <description>MB_HP_1_INT_CLR</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MB_HP_2_INT_CLR</name>
              <description>MB_HP_2_INT_CLR</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MB_HP_3_INT_CLR</name>
              <description>MB_HP_3_INT_CLR</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MB_HP_4_INT_CLR</name>
              <description>MB_HP_4_INT_CLR</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MB_HP_5_INT_CLR</name>
              <description>MB_HP_5_INT_CLR</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MB_HP_6_INT_CLR</name>
              <description>MB_HP_6_INT_CLR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MB_HP_7_INT_CLR</name>
              <description>MB_HP_7_INT_CLR</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MB_HP_8_INT_CLR</name>
              <description>MB_HP_8_INT_CLR</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MB_HP_9_INT_CLR</name>
              <description>MB_HP_9_INT_CLR</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MB_HP_10_INT_CLR</name>
              <description>MB_HP_10_INT_CLR</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MB_HP_11_INT_CLR</name>
              <description>MB_HP_11_INT_CLR</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MB_HP_12_INT_CLR</name>
              <description>MB_HP_12_INT_CLR</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MB_HP_13_INT_CLR</name>
              <description>MB_HP_13_INT_CLR</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MB_HP_14_INT_CLR</name>
              <description>MB_HP_14_INT_CLR</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MB_HP_15_INT_CLR</name>
              <description>MB_HP_15_INT_CLR</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MB_REG_CLK_EN</name>
          <addressOffset>0x60</addressOffset>
          <description>MB_REG_CLK_EN</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MB_REG_CLK_EN</name>
              <description>MB_REG_CLK_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
