esp-rs/esp-pacs/esp32p4-lp/svd/esp32p4-lp.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LP_PERI_PMS</name>
      <description>LP_PERI_PMS</description>
      <groupName>LP_PERI_PMS</groupName>
      <baseAddress>0x5012E000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x000002a0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>TEE_PMS_DATE</name>
          <addressOffset>0x0</addressOffset>
          <description>NA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEE_TEE_DATE</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEE_PMS_CLK_EN</name>
          <addressOffset>0x4</addressOffset>
          <description>NA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEE_REG_CLK_EN</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEE_LP_MM_PMS_REG0</name>
          <addressOffset>0x8</addressOffset>
          <description>NA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEE_REG_LP_MM_LP_SYSREG_ALLOW</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_LP_MM_LP_AONCLKRST_ALLOW</name>
              <description>NA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_LP_MM_LP_TIMER_ALLOW</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_LP_MM_LP_ANAPERI_ALLOW</name>
              <description>NA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_LP_MM_LP_PMU_ALLOW</name>
              <description>NA</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_LP_MM_LP_WDT_ALLOW</name>
              <description>NA</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_LP_MM_LP_MAILBOX_ALLOW</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_LP_MM_LP_RTC_ALLOW</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_LP_MM_LP_PERICLKRST_ALLOW</name>
              <description>NA</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_LP_MM_LP_UART_ALLOW</name>
              <description>NA</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_LP_MM_LP_I2C_ALLOW</name>
              <description>NA</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_LP_MM_LP_SPI_ALLOW</name>
              <description>NA</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_LP_MM_LP_I2CMST_ALLOW</name>
              <description>NA</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_LP_MM_LP_I2S_ALLOW</name>
              <description>NA</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_LP_MM_LP_ADC_ALLOW</name>
              <description>NA</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_LP_MM_LP_TOUCH_ALLOW</name>
              <description>NA</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_LP_MM_LP_IOMUX_ALLOW</name>
              <description>NA</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_LP_MM_LP_INTR_ALLOW</name>
              <description>NA</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_LP_MM_LP_EFUSE_ALLOW</name>
              <description>NA</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_LP_MM_LP_PMS_ALLOW</name>
              <description>NA</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_LP_MM_HP2LP_PMS_ALLOW</name>
              <description>NA</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_LP_MM_LP_TSENS_ALLOW</name>
              <description>NA</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_LP_MM_LP_HUK_ALLOW</name>
              <description>NA</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_LP_MM_LP_TCM_RAM_ALLOW</name>
              <description>NA</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_LP_MM_LP_TRNG_ALLOW</name>
              <description>NA</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEE_PERI_REGION0_LOW</name>
          <addressOffset>0xc</addressOffset>
          <description>NA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEE_REG_PERI_REGION0_LOW</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEE_PERI_REGION0_HIGH</name>
          <addressOffset>0x10</addressOffset>
          <description>NA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEE_REG_PERI_REGION0_HIGH</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEE_PERI_REGION1_LOW</name>
          <addressOffset>0x14</addressOffset>
          <description>NA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEE_REG_PERI_REGION1_LOW</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEE_PERI_REGION1_HIGH</name>
          <addressOffset>0x18</addressOffset>
          <description>NA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEE_REG_PERI_REGION1_HIGH</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEE_PERI_REGION_PMS</name>
          <addressOffset>0x1c</addressOffset>
          <description>NA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEE_REG_LP_CORE_REGION_PMS</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_UM_REGION_PMS</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_MM_REGION_PMS</name>
              <description>NA</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_UM_REGION_PMS</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_MM_REGION_PMS</name>
              <description>NA</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEE_PERI_REGION_2_TO_7_PMS</name>
          <addressOffset>0x20</addressOffset>
          <description>NA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEE_REG_LP_CORE_REGION_2_TO_7_PMS</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_UM_REGION_2_TO_7_PMS</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE0_MM_REGION_2_TO_7_PMS</name>
              <description>NA</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_UM_REGION_2_TO_7_PMS</name>
              <description>NA</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEE_REG_HP_CORE1_MM_REGION_2_TO_7_PMS</name>
              <description>NA</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEE_PERI_REGION2_LOW</name>
          <addressOffset>0x24</addressOffset>
          <description>NA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEE_REG_PERI_REGION2_LOW</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEE_PERI_REGION2_HIGH</name>
          <addressOffset>0x28</addressOffset>
          <description>NA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEE_REG_PERI_REGION2_HIGH</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEE_PERI_REGION3_LOW</name>
          <addressOffset>0x2c</addressOffset>
          <description>NA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEE_REG_PERI_REGION3_LOW</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEE_PERI_REGION3_HIGH</name>
          <addressOffset>0x30</addressOffset>
          <description>NA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEE_REG_PERI_REGION3_HIGH</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEE_PERI_REGION4_LOW</name>
          <addressOffset>0x34</addressOffset>
          <description>NA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEE_REG_PERI_REGION4_LOW</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEE_PERI_REGION4_HIGH</name>
          <addressOffset>0x38</addressOffset>
          <description>NA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEE_REG_PERI_REGION4_HIGH</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEE_PERI_REGION5_LOW</name>
          <addressOffset>0x3c</addressOffset>
          <description>NA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEE_REG_PERI_REGION5_LOW</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEE_PERI_REGION5_HIGH</name>
          <addressOffset>0x40</addressOffset>
          <description>NA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEE_REG_PERI_REGION5_HIGH</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEE_PERI_REGION6_LOW</name>
          <addressOffset>0x44</addressOffset>
          <description>NA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEE_REG_PERI_REGION6_LOW</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEE_PERI_REGION6_HIGH</name>
          <addressOffset>0x48</addressOffset>
          <description>NA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEE_REG_PERI_REGION6_HIGH</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEE_PERI_REGION7_LOW</name>
          <addressOffset>0x4c</addressOffset>
          <description>NA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEE_REG_PERI_REGION7_LOW</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEE_PERI_REGION7_HIGH</name>
          <addressOffset>0x50</addressOffset>
          <description>NA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEE_REG_PERI_REGION7_HIGH</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
