esp-rs/esp-pacs/esp32p4-lp/svd/esp32p4-lp.base.svd
        <register>
          <name>IDBUS_ADDRHOLE_ADDR</name>
          <description>need_des</description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IDBUS_ADDRHOLE_ADDR</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDBUS_ADDRHOLE_INFO</name>
          <description>need_des</description>
          <addressOffset>0x19c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IDBUS_ADDRHOLE_ID</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IDBUS_ADDRHOLE_WR</name>
              <description>need_des</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IDBUS_ADDRHOLE_SECURE</name>
              <description>need_des</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_POR_RST_BYPASS_CTRL</name>
          <description>need_des</description>
          <addressOffset>0x1a0</addressOffset>
          <size>32</size>
          <resetValue>0xff00ff00</resetValue>
          <fields>
            <field>
              <name>HP_PO_CNNT_RSTN_BYPASS_CTRL</name>
              <description>[15] 1'b1: po_cnnt_rstn bypass sys_sw_rstn
[14] 1'b1: po_cnnt_rstn bypass hp_wdt_sys_rstn
[13] 1'b1: po_cnnt_rstn bypass hp_cpu_intrusion_rstn
[12] 1'b1: po_cnnt_rstn bypass hp_sdio_sys_rstn
[11] 1'b1: po_cnnt_rstn bypass usb_jtag_chip_rst
[10] 1'b1: po_cnnt_rstn bypass usb_uart_chip_rst
[9] 1'b1: po_cnnt_rstn bypass lp_wdt_hp_sys_rstn
[8] 1'b1: po_cnnt_rstn bypass efuse_err_rstn</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_PO_RSTN_BYPASS_CTRL</name>
              <description>[31] 1'b1: po_rstn bypass sys_sw_rstn
[30] 1'b1: po_rstn bypass hp_wdt_sys_rstn
[29] 1'b1: po_rstn bypass hp_cpu_intrusion_rstn
[28] 1'b1: po_rstn bypass hp_sdio_sys_rstn
[27] 1'b1: po_rstn bypass usb_jtag_chip_rst
[26] 1'b1: po_rstn bypass usb_uart_chip_rst
[25] 1'b1: po_rstn bypass lp_wdt_hp_sys_rstn
[24] 1'b1: po_rstn bypass efuse_err_rstn</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RNG_DATA</name>
          <description>rng data register</description>
          <addressOffset>0x1a4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RND_DATA</name>
              <description>result of rng output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_CORE_AHB_TIMEOUT</name>
          <description>need_des</description>
          <addressOffset>0x1b0</addressOffset>
          <size>32</size>
          <resetValue>0x7fffff</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>set this field to 1 to enable lp core ahb timeout handle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THRES</name>
              <description>This field used to set lp core ahb bus timeout  threshold</description>
              <bitOffset>1</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP2HP_AHB_TIMEOUT_EN</name>
              <description>set this field to 1 to enable lp2hp ahb timeout handle</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP2HP_AHB_TIMEOUT_THRES</name>
              <description>This field used to set lp2hp ahb bus timeout  threshold</description>
              <bitOffset>18</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_CORE_IBUS_TIMEOUT</name>
          <description>need_des</description>
          <addressOffset>0x1b4</addressOffset>
          <size>32</size>
          <resetValue>0x1ffff</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>set this field to 1 to enable lp core ibus timeout handle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THRES</name>
              <description>This field used to set lp core ibus timeout  threshold</description>
              <bitOffset>1</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_CORE_DBUS_TIMEOUT</name>
          <description>need_des</description>
          <addressOffset>0x1b8</addressOffset>
          <size>32</size>
          <resetValue>0x1ffff</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>set this field to 1 to enable lp core dbus timeout handle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THRES</name>
              <description>This field used to set lp core dbus timeout  threshold</description>
              <bitOffset>1</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_CORE_ERR_RESP_DIS</name>
          <description>need_des</description>
          <addressOffset>0x1bc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_CORE_ERR_RESP_DIS</name>
              <description>Set bit0 to disable ibus err resp;Set bit1 to disable dbus err resp; Set bit 2 to disable ahb err resp.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RNG_CFG</name>
          <description>rng cfg register</description>
          <addressOffset>0x1c0</addressOffset>
          <size>32</size>
          <resetValue>0x3</resetValue>
          <fields>
            <field>
              <name>RNG_TIMER_EN</name>
              <description>enable rng timer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RNG_TIMER_PSCALE</name>
              <description>configure ng timer pscale</description>
              <bitOffset>1</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RNG_SAR_ENABLE</name>
              <description>enable rng_saradc</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RNG_SAR_DATA</name>
              <description>debug rng sar sample cnt</description>
              <bitOffset>16</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD_RTC_HOLD_CTRL0</name>
          <description>enable pad hold ctrl</description>
          <addressOffset>0x1c4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PAD_RTC_HOLD_CTRL0</name>
              <description>Set 1 to hold pad 0-31 status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD_RTC_HOLD_CTRL1</name>
          <description>enable pad hold ctrl</description>
          <addressOffset>0x1c8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PAD_RTC_HOLD_CTRL1</name>
              <description>Set 1 to hold pad 32-56 status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>25</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DED_PAD_RTC_HOLD_CTRL</name>
          <description>enable pad hold ctrl</description>
          <addressOffset>0x1cc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DED_PAD_RTC_HOLD_CTRL</name>
              <description>Set bit0-5 to hold flash pad status. Set bit6-25 to hold psram pad status.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DISCHARGE</name>
          <description>pufmem / ldo flash power discharge control</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <resetValue>0x4</resetValue>
          <fields>
            <field>
              <name>LDO_FLASH_DISCHARGE</name>
              <description>Set this bit to discharge ldo flash.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_PUF_MEM_ISO_EN</name>
              <description>Set this bit to discharge lp puf mem.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_PUF_MEM_XPD</name>
              <description>Set this bit to discharge lp puf mem.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_PUF_MEM_DISCHARGE</name>
              <description>Set this bit to discharge lp puf mem.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_USB_OTGHS_PHY_CTRL</name>
          <description>Usb otg2.0 PHY control register</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <resetValue>0x7</resetValue>
          <fields>
            <field>
              <name>HP_UTMIOTG_IDPULLUP</name>
              <description>Set this bit to pull up USB OTG2.0 PHY id</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_UTMIOTG_DPPULLDOWN</name>
              <description>Set this bit to pull down USB OTG2.0 PHY dp</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_UTMIOTG_DMPULLDOWN</name>
              <description>Set this bit to pull down USB OTG2.0 PHY dm</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_UTMISRP_CHRGVBUS</name>
              <description>Set this bit to charge USB OTG2.0 PHY vbus</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_UTMISRP_DISCHRGVBUS</name>
              <description>Set this bit to discharge USB OTG2.0 PHY vbus</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
