esp-rs/esp-pacs/esp32p4-lp/svd/esp32p4-lp.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LP_TRNG</name>
      <description>LP_TRNG</description>
      <groupName>LP_TRNG</groupName>
      <baseAddress>0x50126000</baseAddress>
      <interrupt>
        <name>LP_TRNG</name>
        <description>LP TRNG interrupt</description>
        <value>15</value>
      </interrupt>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000080</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>RNG_CFG</name>
          <addressOffset>0x0</addressOffset>
          <description>configure rng register</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RNG_SAMPLE_ENABLE</name>
              <description>enable rng RO 1: enable RO 0: disable RO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RNG_TIMER_PSCALE</name>
              <description>configure rng timer clk div</description>
              <bitOffset>1</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RNG_TIMER_EN</name>
              <description>enable rng xor async rng timer</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RNG_SAMPLE_CNT</name>
              <description>get rng RO sample cnt</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RNG_DATA</name>
          <addressOffset>0x4</addressOffset>
          <description>RNG result register</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RNG_DATA</name>
              <description>get rng data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RNG_RSTN</name>
          <addressOffset>0x8</addressOffset>
          <description>rng rstn register</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RNG_RSTN</name>
              <description>enable rng system reset: 1: not reset, 0: reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RNG_DATE</name>
          <addressOffset>0xc</addressOffset>
          <description>RNG_DATE</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RNG_DATE</name>
              <description>RNG_DATE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RNG_CLK_EN</name>
              <description>RNG_CLK_EN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>LP_TSENS</name>
      <description>Low-power Temperature Sensor</description>
      <groupName>TSENS</groupName>
      <baseAddress>0x5012f000</baseAddress>
      <interrupt>
        <name>LP_TSENS</name>
        <description>LP temperature sensor interrupt</description>
        <value>20</value>
      </interrupt>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x38</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Tsens configuration.</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x19400</resetValue>
          <fields>
            <field>
              <name>OUT</name>
              <description>Temperature sensor data out.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>READY</name>
              <description>Indicate temperature sensor out ready.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAMPLE_EN</name>
              <description>Enable sample signal for wakeup module.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKEUP_MASK</name>
              <description>Wake up signal  mask.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT_EN</name>
              <description>Enable temperature sensor to send out interrupt.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_INV</name>
              <description>Invert temperature sensor data.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_DIV</name>
              <description>Temperature sensor clock divider.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POWER_UP</name>
              <description>Temperature sensor power up.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POWER_UP_FORCE</name>
              <description>1: dump out &amp; power up controlled by SW,  0: by FSM.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL2</name>
          <description>Tsens configuration.</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x4002</resetValue>
          <fields>
            <field>
              <name>XPD_WAIT</name>
              <description>N/A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPD_FORCE</name>
              <description>N/A</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_INV</name>
              <description>N/A</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>Tsens interrupt raw registers.</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COCPU_TSENS_WAKE_INT_RAW</name>
              <description>Tsens wakeup interrupt raw.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>Tsens interrupt status registers.</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COCPU_TSENS_WAKE_INT_ST</name>
              <description>Tsens wakeup interrupt status.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>Tsens interrupt enable registers.</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COCPU_TSENS_WAKE_INT_ENA</name>
              <description>Tsens wakeup interrupt enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>Tsens interrupt clear registers.</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COCPU_TSENS_WAKE_INT_CLR</name>
              <description>Tsens wakeup interrupt clear.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_CONF</name>
          <description>Tsens regbank configuration registers.</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Tsens regbank clock gating enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA_W1TS</name>
          <description>Tsens wakeup interrupt enable assert.</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COCPU_TSENS_WAKE_INT_ENA_W1TS</name>
              <description>Write 1 to this field to assert interrupt enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA_W1TC</name>
          <description>Tsens wakeup interrupt enable deassert.</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COCPU_TSENS_WAKE_INT_ENA_W1TC</name>
              <description>Write 1 to this field to deassert interrupt enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WAKEUP_CTRL</name>
          <description>Tsens wakeup control registers.</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0x3fc000</resetValue>
          <fields>
            <field>
              <name>WAKEUP_TH_LOW</name>
              <description>Lower threshold.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKEUP_TH_HIGH</name>
              <description>Upper threshold.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKEUP_OVER_UPPER_TH</name>
              <description>Indicates that this wakeup event arose from exceeding upper threshold.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WAKEUP_EN</name>
              <description>Tsens wakeup enable.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKEUP_MODE</name>
              <description>0:absolute value comparison mode. 1: relative value comparison mode.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAMPLE_RATE</name>
          <description>Hardware automatic sampling control registers.</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0x14</resetValue>
          <fields>
            <field>
              <name>SAMPLE_RATE</name>
              <description>Hardware automatic sampling rate.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RND_ECO_LOW</name>
          <description>N/A</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RND_ECO_LOW</name>
              <description>N/A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RND_ECO_HIGH</name>
          <description>N/A</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>RND_ECO_HIGH</name>
              <description>N/A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RND_ECO_CS</name>
          <description>N/A</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RND_ECO_EN</name>
              <description>N/A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RND_ECO_RESULT</name>
              <description>N/A</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
