esp-rs/esp-pacs/esp32p4-lp/svd/esp32p4-lp.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LP_WDT</name>
      <description>Low-power Watchdog Timer</description>
      <groupName>RTC_WDT</groupName>
      <baseAddress>0x50116000</baseAddress>
      <interrupt>
        <name>LP_WDT</name>
        <description>LP watchdog interrupt</description>
        <value>27</value>
      </interrupt>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x38</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CONFIG0</name>
          <description>need_des</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x13214</resetValue>
          <fields>
            <field>
              <name>WDT_CHIP_RESET_WIDTH</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_CHIP_RESET_EN</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_PAUSE_IN_SLP</name>
              <description>need_des</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_APPCPU_RESET_EN</name>
              <description>need_des</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_PROCPU_RESET_EN</name>
              <description>need_des</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_FLASHBOOT_MOD_EN</name>
              <description>need_des</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_SYS_RESET_LENGTH</name>
              <description>need_des</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_CPU_RESET_LENGTH</name>
              <description>need_des</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_STG3</name>
              <description>need_des</description>
              <bitOffset>19</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_STG2</name>
              <description>need_des</description>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_STG1</name>
              <description>need_des</description>
              <bitOffset>25</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_STG0</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_EN</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG1</name>
          <description>need_des</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x30d40</resetValue>
          <fields>
            <field>
              <name>WDT_STG0_HOLD</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG2</name>
          <description>need_des</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0x13880</resetValue>
          <fields>
            <field>
              <name>WDT_STG1_HOLD</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG3</name>
          <description>need_des</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0xfff</resetValue>
          <fields>
            <field>
              <name>WDT_STG2_HOLD</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG4</name>
          <description>need_des</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0xfff</resetValue>
          <fields>
            <field>
              <name>WDT_STG3_HOLD</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FEED</name>
          <description>need_des</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FEED</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WPROTECT</name>
          <description>need_des</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WDT_WKEY</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWD_CONFIG</name>
          <description>need_des</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0x12c00000</resetValue>
          <fields>
            <field>
              <name>SWD_RESET_FLAG</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SWD_AUTO_FEED_EN</name>
              <description>need_des</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWD_RST_FLAG_CLR</name>
              <description>need_des</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SWD_SIGNAL_WIDTH</name>
              <description>need_des</description>
              <bitOffset>20</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWD_DISABLE</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWD_FEED</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWD_WPROTECT</name>
          <description>need_des</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SWD_WKEY</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>need_des</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SUPER_WDT_INT_RAW</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_WDT_INT_RAW</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>need_des</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SUPER_WDT_INT_ST</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_WDT_INT_ST</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>need_des</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SUPER_WDT_INT_ENA</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_WDT_INT_ENA</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>need_des</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SUPER_WDT_INT_CLR</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_WDT_INT_CLR</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>need_des</description>
          <addressOffset>0x3fc</addressOffset>
          <size>32</size>
          <resetValue>0x2212060</resetValue>
          <fields>
            <field>
              <name>LP_WDT_DATE</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
