esp-rs/esp-pacs/esp32p4-lp/svd/esp32p4-lp.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PMU</name>
      <description>PMU</description>
      <groupName>PMU</groupName>
      <baseAddress>0x50115000</baseAddress>
      <interrupt>
        <name>LP_PMU</name>
        <description>LP PMU interrupt</description>
        <value>24</value>
      </interrupt>
      <addressBlock>
        <offset>0</offset>
        <size>0x000010e0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PMU_HP_ACTIVE_DIG_POWER</name>
          <addressOffset>0x0</addressOffset>
          <description>PMU_HP_ACTIVE_DIG_POWER</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_HP_ACTIVE_DCDC_SWITCH_PD_EN</name>
              <description>PMU_HP_ACTIVE_DCDC_SWITCH_PD_EN</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_ACTIVE_HP_MEM_DSLP</name>
              <description>PMU_HP_ACTIVE_HP_MEM_DSLP</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_ACTIVE_PD_HP_MEM_PD_EN</name>
              <description>PMU_HP_ACTIVE_PD_HP_MEM_PD_EN</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_ACTIVE_PD_HP_CPU_PD_EN</name>
              <description>PMU_HP_ACTIVE_PD_HP_CPU_PD_EN</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_ACTIVE_PD_CNNT_PD_EN</name>
              <description>PMU_HP_ACTIVE_PD_CNNT_PD_EN</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_ACTIVE_PD_TOP_PD_EN</name>
              <description>PMU_HP_ACTIVE_PD_TOP_PD_EN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_HP_ACTIVE_ICG_HP_FUNC</name>
          <addressOffset>0x4</addressOffset>
          <description>PMU_HP_ACTIVE_ICG_HP_FUNC</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_HP_ACTIVE_DIG_ICG_FUNC_EN</name>
              <description>PMU_HP_ACTIVE_DIG_ICG_FUNC_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_HP_ACTIVE_ICG_HP_APB</name>
          <addressOffset>0x8</addressOffset>
          <description>PMU_HP_ACTIVE_ICG_HP_APB</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_HP_ACTIVE_DIG_ICG_APB_EN</name>
              <description>PMU_HP_ACTIVE_DIG_ICG_APB_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_HP_ACTIVE_ICG_MODEM</name>
          <addressOffset>0xc</addressOffset>
          <description>PMU_HP_ACTIVE_ICG_MODEM</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_HP_ACTIVE_DIG_ICG_MODEM_CODE</name>
              <description>PMU_HP_ACTIVE_DIG_ICG_MODEM_CODE</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_HP_ACTIVE_HP_SYS_CNTL</name>
          <addressOffset>0x10</addressOffset>
          <description>PMU_HP_ACTIVE_HP_SYS_CNTL</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_HP_ACTIVE_HP_POWER_DET_BYPASS</name>
              <description>PMU_HP_ACTIVE_HP_POWER_DET_BYPASS</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_ACTIVE_UART_WAKEUP_EN</name>
              <description>PMU_HP_ACTIVE_UART_WAKEUP_EN</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_ACTIVE_LP_PAD_HOLD_ALL</name>
              <description>PMU_HP_ACTIVE_LP_PAD_HOLD_ALL</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_ACTIVE_HP_PAD_HOLD_ALL</name>
              <description>PMU_HP_ACTIVE_HP_PAD_HOLD_ALL</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_ACTIVE_DIG_PAD_SLP_SEL</name>
              <description>PMU_HP_ACTIVE_DIG_PAD_SLP_SEL</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_ACTIVE_DIG_PAUSE_WDT</name>
              <description>PMU_HP_ACTIVE_DIG_PAUSE_WDT</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_ACTIVE_DIG_CPU_STALL</name>
              <description>PMU_HP_ACTIVE_DIG_CPU_STALL</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_HP_ACTIVE_HP_CK_POWER</name>
          <addressOffset>0x14</addressOffset>
          <description>PMU_HP_ACTIVE_HP_CK_POWER</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_HP_ACTIVE_I2C_ISO_EN</name>
              <description>PMU_HP_ACTIVE_I2C_ISO_EN</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_ACTIVE_I2C_RETENTION</name>
              <description>PMU_HP_ACTIVE_I2C_RETENTION</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_ACTIVE_XPD_PLL_I2C</name>
              <description>PMU_HP_ACTIVE_XPD_PLL_I2C</description>
              <bitOffset>23</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_ACTIVE_XPD_PLL</name>
              <description>PMU_HP_ACTIVE_XPD_PLL</description>
              <bitOffset>27</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_HP_ACTIVE_BIAS</name>
          <addressOffset>0x18</addressOffset>
          <description>PMU_HP_ACTIVE_BIAS</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_HP_ACTIVE_DCM_VSET</name>
              <description>PMU_HP_ACTIVE_DCM_VSET</description>
              <bitOffset>18</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_ACTIVE_DCM_MODE</name>
              <description>PMU_HP_ACTIVE_DCM_MODE</description>
              <bitOffset>23</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_ACTIVE_XPD_BIAS</name>
              <description>PMU_HP_ACTIVE_XPD_BIAS</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_ACTIVE_DBG_ATTEN</name>
              <description>PMU_HP_ACTIVE_DBG_ATTEN</description>
              <bitOffset>26</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_ACTIVE_PD_CUR</name>
              <description>PMU_HP_ACTIVE_PD_CUR</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_ACTIVE_BIAS_SLEEP</name>
              <description>PMU_HP_ACTIVE_BIAS_SLEEP</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_HP_ACTIVE_BACKUP</name>
          <addressOffset>0x1c</addressOffset>
          <description>PMU_HP_ACTIVE_BACKUP</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_HP_SLEEP2ACTIVE_BACKUP_MODEM_CLK_CODE</name>
              <description>PMU_HP_SLEEP2ACTIVE_BACKUP_MODEM_CLK_CODE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_MODEM2ACTIVE_BACKUP_MODEM_CLK_CODE</name>
              <description>PMU_HP_MODEM2ACTIVE_BACKUP_MODEM_CLK_CODE</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_ACTIVE_RETENTION_MODE</name>
              <description>PMU_HP_ACTIVE_RETENTION_MODE</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_SLEEP2ACTIVE_RETENTION_EN</name>
              <description>PMU_HP_SLEEP2ACTIVE_RETENTION_EN</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_MODEM2ACTIVE_RETENTION_EN</name>
              <description>PMU_HP_MODEM2ACTIVE_RETENTION_EN</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_SLEEP2ACTIVE_BACKUP_CLK_SEL</name>
              <description>PMU_HP_SLEEP2ACTIVE_BACKUP_CLK_SEL</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_MODEM2ACTIVE_BACKUP_CLK_SEL</name>
              <description>PMU_HP_MODEM2ACTIVE_BACKUP_CLK_SEL</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_SLEEP2ACTIVE_BACKUP_MODE</name>
              <description>PMU_HP_SLEEP2ACTIVE_BACKUP_MODE</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_MODEM2ACTIVE_BACKUP_MODE</name>
              <description>PMU_HP_MODEM2ACTIVE_BACKUP_MODE</description>
              <bitOffset>23</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_SLEEP2ACTIVE_BACKUP_EN</name>
              <description>PMU_HP_SLEEP2ACTIVE_BACKUP_EN</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_MODEM2ACTIVE_BACKUP_EN</name>
              <description>PMU_HP_MODEM2ACTIVE_BACKUP_EN</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_HP_ACTIVE_BACKUP_CLK</name>
          <addressOffset>0x20</addressOffset>
          <description>PMU_HP_ACTIVE_BACKUP_CLK</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_HP_ACTIVE_BACKUP_ICG_FUNC_EN</name>
              <description>PMU_HP_ACTIVE_BACKUP_ICG_FUNC_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_HP_ACTIVE_SYSCLK</name>
          <addressOffset>0x24</addressOffset>
          <description>PMU_HP_ACTIVE_SYSCLK</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_HP_ACTIVE_DIG_SYS_CLK_NO_DIV</name>
              <description>PMU_HP_ACTIVE_DIG_SYS_CLK_NO_DIV</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_ACTIVE_ICG_SYS_CLOCK_EN</name>
              <description>PMU_HP_ACTIVE_ICG_SYS_CLOCK_EN</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_ACTIVE_SYS_CLK_SLP_SEL</name>
              <description>PMU_HP_ACTIVE_SYS_CLK_SLP_SEL</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_ACTIVE_ICG_SLP_SEL</name>
              <description>PMU_HP_ACTIVE_ICG_SLP_SEL</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_ACTIVE_DIG_SYS_CLK_SEL</name>
              <description>PMU_HP_ACTIVE_DIG_SYS_CLK_SEL</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_HP_ACTIVE_HP_REGULATOR0</name>
          <addressOffset>0x28</addressOffset>
          <description>PMU_HP_ACTIVE_HP_REGULATOR0</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_LP_DBIAS_VOL</name>
              <description>PMU_LP_DBIAS_VOL</description>
              <bitOffset>4</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_HP_DBIAS_VOL</name>
              <description>PMU_HP_DBIAS_VOL</description>
              <bitOffset>9</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_DIG_REGULATOR0_DBIAS_SEL</name>
              <description>PMU_DIG_REGULATOR0_DBIAS_SEL</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_DIG_DBIAS_INIT</name>
              <description>PMU_DIG_DBIAS_INIT</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_HP_ACTIVE_HP_REGULATOR_SLP_MEM_XPD</name>
              <description>PMU_HP_ACTIVE_HP_REGULATOR_SLP_MEM_XPD</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_ACTIVE_HP_REGULATOR_SLP_LOGIC_XPD</name>
              <description>PMU_HP_ACTIVE_HP_REGULATOR_SLP_LOGIC_XPD</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_ACTIVE_HP_REGULATOR_XPD</name>
              <description>PMU_HP_ACTIVE_HP_REGULATOR_XPD</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_ACTIVE_HP_REGULATOR_SLP_MEM_DBIAS</name>
              <description>PMU_HP_ACTIVE_HP_REGULATOR_SLP_MEM_DBIAS</description>
              <bitOffset>19</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_ACTIVE_HP_REGULATOR_SLP_LOGIC_DBIAS</name>
              <description>PMU_HP_ACTIVE_HP_REGULATOR_SLP_LOGIC_DBIAS</description>
              <bitOffset>23</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_ACTIVE_HP_REGULATOR_DBIAS</name>
              <description>PMU_HP_ACTIVE_HP_REGULATOR_DBIAS</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_HP_ACTIVE_HP_REGULATOR1</name>
          <addressOffset>0x2c</addressOffset>
          <description>PMU_HP_ACTIVE_HP_REGULATOR1</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_HP_ACTIVE_HP_REGULATOR_DRV_B</name>
              <description>PMU_HP_ACTIVE_HP_REGULATOR_DRV_B</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_HP_ACTIVE_XTAL</name>
          <addressOffset>0x30</addressOffset>
          <description>PMU_HP_ACTIVE_XTAL</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_HP_ACTIVE_XPD_XTAL</name>
              <description>PMU_HP_ACTIVE_XPD_XTAL</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_HP_MODEM_DIG_POWER</name>
          <addressOffset>0x34</addressOffset>
          <description>PMU_HP_MODEM_DIG_POWER</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_HP_MODEM_DCDC_SWITCH_PD_EN</name>
              <description>PMU_HP_MODEM_DCDC_SWITCH_PD_EN</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_MODEM_HP_MEM_DSLP</name>
              <description>PMU_HP_MODEM_HP_MEM_DSLP</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_HP_MODEM_PD_HP_MEM_PD_EN</name>
              <description>PMU_HP_MODEM_PD_HP_MEM_PD_EN</description>
              <bitOffset>23</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_HP_MODEM_PD_HP_WIFI_PD_EN</name>
              <description>PMU_HP_MODEM_PD_HP_WIFI_PD_EN</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_HP_MODEM_PD_HP_CPU_PD_EN</name>
              <description>PMU_HP_MODEM_PD_HP_CPU_PD_EN</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_HP_MODEM_PD_CNNT_PD_EN</name>
              <description>PMU_HP_MODEM_PD_CNNT_PD_EN</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_HP_MODEM_PD_TOP_PD_EN</name>
              <description>PMU_HP_MODEM_PD_TOP_PD_EN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_HP_MODEM_ICG_HP_FUNC</name>
          <addressOffset>0x38</addressOffset>
          <description>PMU_HP_MODEM_ICG_HP_FUNC</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_HP_MODEM_DIG_ICG_FUNC_EN</name>
              <description>PMU_HP_MODEM_DIG_ICG_FUNC_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_HP_MODEM_ICG_HP_APB</name>
          <addressOffset>0x3c</addressOffset>
          <description>PMU_HP_MODEM_ICG_HP_APB</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_HP_MODEM_DIG_ICG_APB_EN</name>
              <description>PMU_HP_MODEM_DIG_ICG_APB_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
