esp-rs/esp-pacs/esp32p4-lp/svd/esp32p4-lp.base.svd
        <register>
          <name>PMU_HP_SLEEP_BACKUP</name>
          <addressOffset>0x84</addressOffset>
          <description>PMU_HP_SLEEP_BACKUP</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_HP_MODEM2SLEEP_BACKUP_MODEM_CLK_CODE</name>
              <description>PMU_HP_MODEM2SLEEP_BACKUP_MODEM_CLK_CODE</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_ACTIVE2SLEEP_BACKUP_MODEM_CLK_CODE</name>
              <description>PMU_HP_ACTIVE2SLEEP_BACKUP_MODEM_CLK_CODE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_SLEEP_RETENTION_MODE</name>
              <description>PMU_HP_SLEEP_RETENTION_MODE</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_MODEM2SLEEP_RETENTION_EN</name>
              <description>PMU_HP_MODEM2SLEEP_RETENTION_EN</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_ACTIVE2SLEEP_RETENTION_EN</name>
              <description>PMU_HP_ACTIVE2SLEEP_RETENTION_EN</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_MODEM2SLEEP_BACKUP_CLK_SEL</name>
              <description>PMU_HP_MODEM2SLEEP_BACKUP_CLK_SEL</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_ACTIVE2SLEEP_BACKUP_CLK_SEL</name>
              <description>PMU_HP_ACTIVE2SLEEP_BACKUP_CLK_SEL</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_MODEM2SLEEP_BACKUP_MODE</name>
              <description>PMU_HP_MODEM2SLEEP_BACKUP_MODE</description>
              <bitOffset>23</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_ACTIVE2SLEEP_BACKUP_MODE</name>
              <description>PMU_HP_ACTIVE2SLEEP_BACKUP_MODE</description>
              <bitOffset>26</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_MODEM2SLEEP_BACKUP_EN</name>
              <description>PMU_HP_MODEM2SLEEP_BACKUP_EN</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_ACTIVE2SLEEP_BACKUP_EN</name>
              <description>PMU_HP_ACTIVE2SLEEP_BACKUP_EN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_HP_SLEEP_BACKUP_CLK</name>
          <addressOffset>0x88</addressOffset>
          <description>PMU_HP_SLEEP_BACKUP_CLK</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_HP_SLEEP_BACKUP_ICG_FUNC_EN</name>
              <description>PMU_HP_SLEEP_BACKUP_ICG_FUNC_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_HP_SLEEP_SYSCLK</name>
          <addressOffset>0x8c</addressOffset>
          <description>PMU_HP_SLEEP_SYSCLK</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_HP_SLEEP_DIG_SYS_CLK_NO_DIV</name>
              <description>PMU_HP_SLEEP_DIG_SYS_CLK_NO_DIV</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_SLEEP_ICG_SYS_CLOCK_EN</name>
              <description>PMU_HP_SLEEP_ICG_SYS_CLOCK_EN</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_SLEEP_SYS_CLK_SLP_SEL</name>
              <description>PMU_HP_SLEEP_SYS_CLK_SLP_SEL</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_SLEEP_ICG_SLP_SEL</name>
              <description>PMU_HP_SLEEP_ICG_SLP_SEL</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_SLEEP_DIG_SYS_CLK_SEL</name>
              <description>PMU_HP_SLEEP_DIG_SYS_CLK_SEL</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_HP_SLEEP_HP_REGULATOR0</name>
          <addressOffset>0x90</addressOffset>
          <description>PMU_HP_SLEEP_HP_REGULATOR0</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_HP_SLEEP_HP_REGULATOR_SLP_MEM_XPD</name>
              <description>PMU_HP_SLEEP_HP_REGULATOR_SLP_MEM_XPD</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_SLEEP_HP_REGULATOR_SLP_LOGIC_XPD</name>
              <description>PMU_HP_SLEEP_HP_REGULATOR_SLP_LOGIC_XPD</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_SLEEP_HP_REGULATOR_XPD</name>
              <description>PMU_HP_SLEEP_HP_REGULATOR_XPD</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_SLEEP_HP_REGULATOR_SLP_MEM_DBIAS</name>
              <description>PMU_HP_SLEEP_HP_REGULATOR_SLP_MEM_DBIAS</description>
              <bitOffset>19</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_SLEEP_HP_REGULATOR_SLP_LOGIC_DBIAS</name>
              <description>PMU_HP_SLEEP_HP_REGULATOR_SLP_LOGIC_DBIAS</description>
              <bitOffset>23</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_SLEEP_HP_REGULATOR_DBIAS</name>
              <description>PMU_HP_SLEEP_HP_REGULATOR_DBIAS</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_HP_SLEEP_HP_REGULATOR1</name>
          <addressOffset>0x94</addressOffset>
          <description>PMU_HP_SLEEP_HP_REGULATOR1</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_HP_SLEEP_HP_REGULATOR_DRV_B</name>
              <description>PMU_HP_SLEEP_HP_REGULATOR_DRV_B</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_HP_SLEEP_XTAL</name>
          <addressOffset>0x98</addressOffset>
          <description>PMU_HP_SLEEP_XTAL</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_HP_SLEEP_XPD_XTAL</name>
              <description>PMU_HP_SLEEP_XPD_XTAL</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_HP_SLEEP_LP_REGULATOR0</name>
          <addressOffset>0x9c</addressOffset>
          <description>PMU_HP_SLEEP_LP_REGULATOR0</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_HP_SLEEP_LP_REGULATOR_SLP_XPD</name>
              <description>PMU_HP_SLEEP_LP_REGULATOR_SLP_XPD</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_SLEEP_LP_REGULATOR_XPD</name>
              <description>PMU_HP_SLEEP_LP_REGULATOR_XPD</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_SLEEP_LP_REGULATOR_SLP_DBIAS</name>
              <description>PMU_HP_SLEEP_LP_REGULATOR_SLP_DBIAS</description>
              <bitOffset>23</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_SLEEP_LP_REGULATOR_DBIAS</name>
              <description>PMU_HP_SLEEP_LP_REGULATOR_DBIAS</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_HP_SLEEP_LP_REGULATOR1</name>
          <addressOffset>0xa0</addressOffset>
          <description>PMU_HP_SLEEP_LP_REGULATOR1</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_HP_SLEEP_LP_REGULATOR_DRV_B</name>
              <description>PMU_HP_SLEEP_LP_REGULATOR_DRV_B</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_HP_SLEEP_LP_DIG_POWER</name>
          <addressOffset>0xa8</addressOffset>
          <description>PMU_HP_SLEEP_LP_DIG_POWER</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_HP_SLEEP_LP_PAD_SLP_SEL</name>
              <description>PMU_HP_SLEEP_LP_PAD_SLP_SEL</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_SLEEP_BOD_SOURCE_SEL</name>
              <description>PMU_HP_SLEEP_BOD_SOURCE_SEL</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_SLEEP_VDDBAT_MODE</name>
              <description>PMU_HP_SLEEP_VDDBAT_MODE</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_SLEEP_LP_MEM_DSLP</name>
              <description>PMU_HP_SLEEP_LP_MEM_DSLP</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_SLEEP_PD_LP_PERI_PD_EN</name>
              <description>PMU_HP_SLEEP_PD_LP_PERI_PD_EN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_HP_SLEEP_LP_CK_POWER</name>
          <addressOffset>0xac</addressOffset>
          <description>PMU_HP_SLEEP_LP_CK_POWER</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_HP_SLEEP_XPD_LPPLL</name>
              <description>PMU_HP_SLEEP_XPD_LPPLL</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_SLEEP_XPD_XTAL32K</name>
              <description>PMU_HP_SLEEP_XPD_XTAL32K</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_SLEEP_XPD_RC32K</name>
              <description>PMU_HP_SLEEP_XPD_RC32K</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_SLEEP_XPD_FOSC_CLK</name>
              <description>PMU_HP_SLEEP_XPD_FOSC_CLK</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_SLEEP_PD_OSC_CLK</name>
              <description>PMU_HP_SLEEP_PD_OSC_CLK</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_LP_SLEEP_LP_REGULATOR0</name>
          <addressOffset>0xb4</addressOffset>
          <description>PMU_LP_SLEEP_LP_REGULATOR0</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_LP_SLEEP_LP_REGULATOR_SLP_XPD</name>
              <description>PMU_LP_SLEEP_LP_REGULATOR_SLP_XPD</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_LP_SLEEP_LP_REGULATOR_XPD</name>
              <description>PMU_LP_SLEEP_LP_REGULATOR_XPD</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_LP_SLEEP_LP_REGULATOR_SLP_DBIAS</name>
              <description>PMU_LP_SLEEP_LP_REGULATOR_SLP_DBIAS</description>
              <bitOffset>23</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_LP_SLEEP_LP_REGULATOR_DBIAS</name>
              <description>PMU_LP_SLEEP_LP_REGULATOR_DBIAS</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_LP_SLEEP_LP_REGULATOR1</name>
          <addressOffset>0xb8</addressOffset>
          <description>PMU_LP_SLEEP_LP_REGULATOR1</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_LP_SLEEP_LP_REGULATOR_DRV_B</name>
              <description>PMU_LP_SLEEP_LP_REGULATOR_DRV_B</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_LP_SLEEP_XTAL</name>
          <addressOffset>0xbc</addressOffset>
          <description>PMU_LP_SLEEP_XTAL</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_LP_SLEEP_XPD_XTAL</name>
              <description>PMU_LP_SLEEP_XPD_XTAL</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_LP_SLEEP_LP_DIG_POWER</name>
          <addressOffset>0xc0</addressOffset>
          <description>PMU_LP_SLEEP_LP_DIG_POWER</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_LP_SLEEP_LP_PAD_SLP_SEL</name>
              <description>PMU_LP_SLEEP_LP_PAD_SLP_SEL</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_LP_SLEEP_BOD_SOURCE_SEL</name>
              <description>PMU_LP_SLEEP_BOD_SOURCE_SEL</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_LP_SLEEP_VDDBAT_MODE</name>
              <description>PMU_LP_SLEEP_VDDBAT_MODE</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_LP_SLEEP_LP_MEM_DSLP</name>
              <description>PMU_LP_SLEEP_LP_MEM_DSLP</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_LP_SLEEP_PD_LP_PERI_PD_EN</name>
              <description>PMU_LP_SLEEP_PD_LP_PERI_PD_EN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_LP_SLEEP_LP_CK_POWER</name>
          <addressOffset>0xc4</addressOffset>
          <description>PMU_LP_SLEEP_LP_CK_POWER</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_LP_SLEEP_XPD_LPPLL</name>
              <description>PMU_LP_SLEEP_XPD_LPPLL</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_LP_SLEEP_XPD_XTAL32K</name>
              <description>PMU_LP_SLEEP_XPD_XTAL32K</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_LP_SLEEP_XPD_RC32K</name>
              <description>PMU_LP_SLEEP_XPD_RC32K</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_LP_SLEEP_XPD_FOSC_CLK</name>
              <description>PMU_LP_SLEEP_XPD_FOSC_CLK</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_LP_SLEEP_PD_OSC_CLK</name>
              <description>PMU_LP_SLEEP_PD_OSC_CLK</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_LP_SLEEP_BIAS</name>
          <addressOffset>0xc8</addressOffset>
          <description>PMU_LP_SLEEP_BIAS</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_LP_SLEEP_XPD_BIAS</name>
              <description>PMU_LP_SLEEP_XPD_BIAS</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_LP_SLEEP_DBG_ATTEN</name>
              <description>PMU_LP_SLEEP_DBG_ATTEN</description>
              <bitOffset>26</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_LP_SLEEP_PD_CUR</name>
              <description>PMU_LP_SLEEP_PD_CUR</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_LP_SLEEP_BIAS_SLEEP</name>
              <description>PMU_LP_SLEEP_BIAS_SLEEP</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
