esp-rs/esp-pacs/esp32p4-lp/svd/esp32p4-lp.base.svd
        <register>
          <name>PMU_IMM_HP_CK_POWER</name>
          <addressOffset>0xcc</addressOffset>
          <description>PMU_IMM_HP_CK_POWER</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_TIE_LOW_CALI_XTAL_ICG</name>
              <description>PMU_TIE_LOW_CALI_XTAL_ICG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_TIE_LOW_GLOBAL_PLL_ICG</name>
              <description>PMU_TIE_LOW_GLOBAL_PLL_ICG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_TIE_LOW_GLOBAL_XTAL_ICG</name>
              <description>PMU_TIE_LOW_GLOBAL_XTAL_ICG</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_TIE_LOW_I2C_RETENTION</name>
              <description>PMU_TIE_LOW_I2C_RETENTION</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_TIE_LOW_XPD_PLL_I2C</name>
              <description>PMU_TIE_LOW_XPD_PLL_I2C</description>
              <bitOffset>7</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_TIE_LOW_XPD_PLL</name>
              <description>PMU_TIE_LOW_XPD_PLL</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_TIE_LOW_XPD_XTAL</name>
              <description>PMU_TIE_LOW_XPD_XTAL</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_TIE_HIGH_CALI_XTAL_ICG</name>
              <description>PMU_TIE_HIGH_CALI_XTAL_ICG</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_TIE_HIGH_GLOBAL_PLL_ICG</name>
              <description>PMU_TIE_HIGH_GLOBAL_PLL_ICG</description>
              <bitOffset>17</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_TIE_HIGH_GLOBAL_XTAL_ICG</name>
              <description>PMU_TIE_HIGH_GLOBAL_XTAL_ICG</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_TIE_HIGH_I2C_RETENTION</name>
              <description>PMU_TIE_HIGH_I2C_RETENTION</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_TIE_HIGH_XPD_PLL_I2C</name>
              <description>PMU_TIE_HIGH_XPD_PLL_I2C</description>
              <bitOffset>23</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_TIE_HIGH_XPD_PLL</name>
              <description>PMU_TIE_HIGH_XPD_PLL</description>
              <bitOffset>27</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_TIE_HIGH_XPD_XTAL</name>
              <description>PMU_TIE_HIGH_XPD_XTAL</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_IMM_SLEEP_SYSCLK</name>
          <addressOffset>0xd0</addressOffset>
          <description>PMU_IMM_SLEEP_SYSCLK</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_UPDATE_DIG_ICG_SWITCH</name>
              <description>PMU_UPDATE_DIG_ICG_SWITCH</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_TIE_LOW_ICG_SLP_SEL</name>
              <description>PMU_TIE_LOW_ICG_SLP_SEL</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_TIE_HIGH_ICG_SLP_SEL</name>
              <description>PMU_TIE_HIGH_ICG_SLP_SEL</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_UPDATE_DIG_SYS_CLK_SEL</name>
              <description>PMU_UPDATE_DIG_SYS_CLK_SEL</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_IMM_HP_FUNC_ICG</name>
          <addressOffset>0xd4</addressOffset>
          <description>PMU_IMM_HP_FUNC_ICG</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_UPDATE_DIG_ICG_FUNC_EN</name>
              <description>PMU_UPDATE_DIG_ICG_FUNC_EN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_IMM_HP_APB_ICG</name>
          <addressOffset>0xd8</addressOffset>
          <description>PMU_IMM_HP_APB_ICG</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_UPDATE_DIG_ICG_APB_EN</name>
              <description>PMU_UPDATE_DIG_ICG_APB_EN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_IMM_MODEM_ICG</name>
          <addressOffset>0xdc</addressOffset>
          <description>PMU_IMM_MODEM_ICG</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_UPDATE_DIG_ICG_MODEM_EN</name>
              <description>PMU_UPDATE_DIG_ICG_MODEM_EN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_IMM_LP_ICG</name>
          <addressOffset>0xe0</addressOffset>
          <description>PMU_IMM_LP_ICG</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_TIE_LOW_LP_ROOTCLK_SEL</name>
              <description>PMU_TIE_LOW_LP_ROOTCLK_SEL</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_TIE_HIGH_LP_ROOTCLK_SEL</name>
              <description>PMU_TIE_HIGH_LP_ROOTCLK_SEL</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_IMM_PAD_HOLD_ALL</name>
          <addressOffset>0xe4</addressOffset>
          <description>PMU_IMM_PAD_HOLD_ALL</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_PAD_SLP_SEL</name>
              <description>PMU_PAD_SLP_SEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_LP_PAD_HOLD_ALL</name>
              <description>PMU_LP_PAD_HOLD_ALL</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_HP_PAD_HOLD_ALL</name>
              <description>PMU_HP_PAD_HOLD_ALL</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_TIE_HIGH_PAD_SLP_SEL</name>
              <description>PMU_TIE_HIGH_PAD_SLP_SEL</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_TIE_LOW_PAD_SLP_SEL</name>
              <description>PMU_TIE_LOW_PAD_SLP_SEL</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_TIE_HIGH_LP_PAD_HOLD_ALL</name>
              <description>PMU_TIE_HIGH_LP_PAD_HOLD_ALL</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_TIE_LOW_LP_PAD_HOLD_ALL</name>
              <description>PMU_TIE_LOW_LP_PAD_HOLD_ALL</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_TIE_HIGH_HP_PAD_HOLD_ALL</name>
              <description>PMU_TIE_HIGH_HP_PAD_HOLD_ALL</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_TIE_LOW_HP_PAD_HOLD_ALL</name>
              <description>PMU_TIE_LOW_HP_PAD_HOLD_ALL</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_IMM_I2C_ISO</name>
          <addressOffset>0xe8</addressOffset>
          <description>PMU_IMM_I2C_ISO</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_TIE_HIGH_I2C_ISO_EN</name>
              <description>PMU_TIE_HIGH_I2C_ISO_EN</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_TIE_LOW_I2C_ISO_EN</name>
              <description>PMU_TIE_LOW_I2C_ISO_EN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_POWER_WAIT_TIMER0</name>
          <addressOffset>0xec</addressOffset>
          <description>PMU_POWER_WAIT_TIMER0</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_DG_HP_POWERDOWN_TIMER</name>
              <description>PMU_DG_HP_POWERDOWN_TIMER</description>
              <bitOffset>5</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_DG_HP_POWERUP_TIMER</name>
              <description>PMU_DG_HP_POWERUP_TIMER</description>
              <bitOffset>14</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_DG_HP_WAIT_TIMER</name>
              <description>PMU_DG_HP_WAIT_TIMER</description>
              <bitOffset>23</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_POWER_WAIT_TIMER1</name>
          <addressOffset>0xf0</addressOffset>
          <description>PMU_POWER_WAIT_TIMER1</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_DG_LP_POWERDOWN_TIMER</name>
              <description>PMU_DG_LP_POWERDOWN_TIMER</description>
              <bitOffset>5</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_DG_LP_POWERUP_TIMER</name>
              <description>PMU_DG_LP_POWERUP_TIMER</description>
              <bitOffset>14</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_DG_LP_WAIT_TIMER</name>
              <description>PMU_DG_LP_WAIT_TIMER</description>
              <bitOffset>23</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_POWER_PD_TOP_CNTL</name>
          <addressOffset>0xf4</addressOffset>
          <description>PMU_POWER_PD_TOP_CNTL</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_FORCE_TOP_RESET</name>
              <description>PMU_FORCE_TOP_RESET</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_FORCE_TOP_ISO</name>
              <description>PMU_FORCE_TOP_ISO</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_FORCE_TOP_PU</name>
              <description>PMU_FORCE_TOP_PU</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_FORCE_TOP_NO_RESET</name>
              <description>PMU_FORCE_TOP_NO_RESET</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_FORCE_TOP_NO_ISO</name>
              <description>PMU_FORCE_TOP_NO_ISO</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_FORCE_TOP_PD</name>
              <description>PMU_FORCE_TOP_PD</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_POWER_PD_CNNT_CNTL</name>
          <addressOffset>0xf8</addressOffset>
          <description>PMU_POWER_PD_CNNT_CNTL</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_FORCE_CNNT_RESET</name>
              <description>PMU_FORCE_CNNT_RESET</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_FORCE_CNNT_ISO</name>
              <description>PMU_FORCE_CNNT_ISO</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_FORCE_CNNT_PU</name>
              <description>PMU_FORCE_CNNT_PU</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_FORCE_CNNT_NO_RESET</name>
              <description>PMU_FORCE_CNNT_NO_RESET</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_FORCE_CNNT_NO_ISO</name>
              <description>PMU_FORCE_CNNT_NO_ISO</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_FORCE_CNNT_PD</name>
              <description>PMU_FORCE_CNNT_PD</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_POWER_PD_HPMEM_CNTL</name>
          <addressOffset>0xfc</addressOffset>
          <description>PMU_POWER_PD_HPMEM_CNTL</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_FORCE_HP_MEM_RESET</name>
              <description>PMU_FORCE_HP_MEM_RESET</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_FORCE_HP_MEM_ISO</name>
              <description>PMU_FORCE_HP_MEM_ISO</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_FORCE_HP_MEM_PU</name>
              <description>PMU_FORCE_HP_MEM_PU</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_FORCE_HP_MEM_NO_RESET</name>
              <description>PMU_FORCE_HP_MEM_NO_RESET</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_FORCE_HP_MEM_NO_ISO</name>
              <description>PMU_FORCE_HP_MEM_NO_ISO</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_FORCE_HP_MEM_PD</name>
              <description>PMU_FORCE_HP_MEM_PD</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_POWER_PD_TOP_MASK</name>
          <addressOffset>0x100</addressOffset>
          <description>PMU_POWER_PD_TOP_MASK</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_XPD_TOP_MASK</name>
              <description>PMU_XPD_TOP_MASK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_PD_TOP_MASK</name>
              <description>PMU_PD_TOP_MASK</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_POWER_PD_CNNT_MASK</name>
          <addressOffset>0x104</addressOffset>
          <description>PMU_POWER_PD_CNNT_MASK</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_XPD_CNNT_MASK</name>
              <description>PMU_XPD_CNNT_MASK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_PD_CNNT_MASK</name>
              <description>PMU_PD_CNNT_MASK</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_POWER_PD_HPMEM_MASK</name>
          <addressOffset>0x108</addressOffset>
          <description>PMU_POWER_PD_HPMEM_MASK</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_XPD_HP_MEM_MASK</name>
              <description>PMU_XPD_HP_MEM_MASK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_PD_HP_MEM_MASK</name>
              <description>PMU_PD_HP_MEM_MASK</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_POWER_DCDC_SWITCH</name>
          <addressOffset>0x10c</addressOffset>
          <description>PMU_POWER_DCDC_SWITCH</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_FORCE_DCDC_SWITCH_PU</name>
              <description>PMU_FORCE_DCDC_SWITCH_PU</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_FORCE_DCDC_SWITCH_PD</name>
              <description>PMU_FORCE_DCDC_SWITCH_PD</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
