esp-rs/esp-pacs/esp32p4-lp/svd/esp32p4-lp.base.svd
        <register>
          <name>PMU_POWER_PD_LPPERI_CNTL</name>
          <addressOffset>0x110</addressOffset>
          <description>PMU_POWER_PD_LPPERI_CNTL</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_FORCE_LP_PERI_RESET</name>
              <description>PMU_FORCE_LP_PERI_RESET</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_FORCE_LP_PERI_ISO</name>
              <description>PMU_FORCE_LP_PERI_ISO</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_FORCE_LP_PERI_PU</name>
              <description>PMU_FORCE_LP_PERI_PU</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_FORCE_LP_PERI_NO_RESET</name>
              <description>PMU_FORCE_LP_PERI_NO_RESET</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_FORCE_LP_PERI_NO_ISO</name>
              <description>PMU_FORCE_LP_PERI_NO_ISO</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_FORCE_LP_PERI_PD</name>
              <description>PMU_FORCE_LP_PERI_PD</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_POWER_PD_LPPERI_MASK</name>
          <addressOffset>0x114</addressOffset>
          <description>PMU_POWER_PD_LPPERI_MASK</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_XPD_LP_PERI_MASK</name>
              <description>PMU_XPD_LP_PERI_MASK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_PD_LP_PERI_MASK</name>
              <description>PMU_PD_LP_PERI_MASK</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_POWER_HP_PAD</name>
          <addressOffset>0x118</addressOffset>
          <description>PMU_POWER_HP_PAD</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_FORCE_HP_PAD_NO_ISO_ALL</name>
              <description>PMU_FORCE_HP_PAD_NO_ISO_ALL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_FORCE_HP_PAD_ISO_ALL</name>
              <description>PMU_FORCE_HP_PAD_ISO_ALL</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_POWER_CK_WAIT_CNTL</name>
          <addressOffset>0x11c</addressOffset>
          <description>PMU_POWER_CK_WAIT_CNTL</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_PMU_WAIT_XTL_STABLE</name>
              <description>PMU_PMU_WAIT_XTL_STABLE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_PMU_WAIT_PLL_STABLE</name>
              <description>PMU_PMU_WAIT_PLL_STABLE</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_SLP_WAKEUP_CNTL0</name>
          <addressOffset>0x120</addressOffset>
          <description>PMU_SLP_WAKEUP_CNTL0</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_SLEEP_REQ</name>
              <description>PMU_SLEEP_REQ</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_SLP_WAKEUP_CNTL1</name>
          <addressOffset>0x124</addressOffset>
          <description>PMU_SLP_WAKEUP_CNTL1</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_SLEEP_REJECT_ENA</name>
              <description>PMU_SLEEP_REJECT_ENA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_SLP_REJECT_EN</name>
              <description>PMU_SLP_REJECT_EN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_SLP_WAKEUP_CNTL2</name>
          <addressOffset>0x128</addressOffset>
          <description>PMU_SLP_WAKEUP_CNTL2</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_WAKEUP_ENA</name>
              <description>PMU_WAKEUP_ENA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_SLP_WAKEUP_CNTL3</name>
          <addressOffset>0x12c</addressOffset>
          <description>PMU_SLP_WAKEUP_CNTL3</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_LP_MIN_SLP_VAL</name>
              <description>PMU_LP_MIN_SLP_VAL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_MIN_SLP_VAL</name>
              <description>PMU_HP_MIN_SLP_VAL</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_SLEEP_PRT_SEL</name>
              <description>PMU_SLEEP_PRT_SEL</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_SLP_WAKEUP_CNTL4</name>
          <addressOffset>0x130</addressOffset>
          <description>PMU_SLP_WAKEUP_CNTL4</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_SLP_REJECT_CAUSE_CLR</name>
              <description>PMU_SLP_REJECT_CAUSE_CLR</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_SLP_WAKEUP_CNTL5</name>
          <addressOffset>0x134</addressOffset>
          <description>PMU_SLP_WAKEUP_CNTL5</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_MODEM_WAIT_TARGET</name>
              <description>PMU_MODEM_WAIT_TARGET</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_LP_ANA_WAIT_TARGET_EXPAND</name>
              <description>PMU_LP_ANA_WAIT_TARGET_EXPAND</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_LP_ANA_WAIT_TARGET</name>
              <description>PMU_LP_ANA_WAIT_TARGET</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_SLP_WAKEUP_CNTL6</name>
          <addressOffset>0x138</addressOffset>
          <description>PMU_SLP_WAKEUP_CNTL6</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_SOC_WAKEUP_WAIT</name>
              <description>PMU_SOC_WAKEUP_WAIT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_SOC_WAKEUP_WAIT_CFG</name>
              <description>PMU_SOC_WAKEUP_WAIT_CFG</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_SLP_WAKEUP_CNTL7</name>
          <addressOffset>0x13c</addressOffset>
          <description>PMU_SLP_WAKEUP_CNTL7</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_ANA_WAIT_TARGET</name>
              <description>PMU_ANA_WAIT_TARGET</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_SLP_WAKEUP_CNTL8</name>
          <addressOffset>0x140</addressOffset>
          <description>PMU_SLP_WAKEUP_CNTL8</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_LP_LITE_WAKEUP_ENA</name>
              <description>PMU_LP_LITE_WAKEUP_ENA</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_SLP_WAKEUP_STATUS0</name>
          <addressOffset>0x144</addressOffset>
          <description>PMU_SLP_WAKEUP_STATUS0</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_WAKEUP_CAUSE</name>
              <description>PMU_WAKEUP_CAUSE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_SLP_WAKEUP_STATUS1</name>
          <addressOffset>0x148</addressOffset>
          <description>PMU_SLP_WAKEUP_STATUS1</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_REJECT_CAUSE</name>
              <description>PMU_REJECT_CAUSE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_SLP_WAKEUP_STATUS2</name>
          <addressOffset>0x14c</addressOffset>
          <description>PMU_SLP_WAKEUP_STATUS2</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_LP_LITE_WAKEUP_CAUSE</name>
              <description>PMU_LP_LITE_WAKEUP_CAUSE</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_HP_CK_POWERON</name>
          <addressOffset>0x150</addressOffset>
          <description>PMU_HP_CK_POWERON</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_I2C_POR_WAIT_TARGET</name>
              <description>PMU_I2C_POR_WAIT_TARGET</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_HP_CK_CNTL</name>
          <addressOffset>0x154</addressOffset>
          <description>PMU_HP_CK_CNTL</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_MODIFY_ICG_CNTL_WAIT</name>
              <description>PMU_MODIFY_ICG_CNTL_WAIT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_SWITCH_ICG_CNTL_WAIT</name>
              <description>PMU_SWITCH_ICG_CNTL_WAIT</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_POR_STATUS</name>
          <addressOffset>0x158</addressOffset>
          <description>PMU_POR_STATUS</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_POR_DONE</name>
              <description>PMU_POR_DONE</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_RF_PWC</name>
          <addressOffset>0x15c</addressOffset>
          <description>PMU_RF_PWC</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_MSPI_PHY_XPD</name>
              <description>PMU_MSPI_PHY_XPD</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_SDIO_PLL_XPD</name>
              <description>PMU_SDIO_PLL_XPD</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_PERIF_I2C_RSTB</name>
              <description>PMU_PERIF_I2C_RSTB</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_XPD_PERIF_I2C</name>
              <description>PMU_XPD_PERIF_I2C</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_XPD_TXRF_I2C</name>
              <description>PMU_XPD_TXRF_I2C</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_XPD_RFRX_PBUS</name>
              <description>PMU_XPD_RFRX_PBUS</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_XPD_CKGEN_I2C</name>
              <description>PMU_XPD_CKGEN_I2C</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_BACKUP_CFG</name>
          <addressOffset>0x160</addressOffset>
          <description>PMU_BACKUP_CFG</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_BACKUP_SYS_CLK_NO_DIV</name>
              <description>PMU_BACKUP_SYS_CLK_NO_DIV</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_INT_RAW</name>
          <addressOffset>0x164</addressOffset>
          <description>PMU_INT_RAW</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_0P1A_CNT_TARGET0_REACH_0_HP_INT_RAW</name>
              <description>reg_0p1a_0_counter after xpd reach target0</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P1A_CNT_TARGET1_REACH_0_HP_INT_RAW</name>
              <description>reg_0p1a_1_counter after xpd reach target1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P1A_CNT_TARGET0_REACH_1_HP_INT_RAW</name>
              <description>reg_0p1a_0 counter after xpd reach target0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P1A_CNT_TARGET1_REACH_1_HP_INT_RAW</name>
              <description>reg_0p1a_1_counter after xpd reach target1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P2A_CNT_TARGET0_REACH_0_HP_INT_RAW</name>
              <description>reg_0p2a_0 counter after xpd reach target0</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P2A_CNT_TARGET1_REACH_0_HP_INT_RAW</name>
              <description>reg_0p2a_1_counter after xpd reach target1</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P2A_CNT_TARGET0_REACH_1_HP_INT_RAW</name>
              <description>reg_0p2a_0 counter after xpd reach target0</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P2A_CNT_TARGET1_REACH_1_HP_INT_RAW</name>
              <description>reg_0p2a_1_counter after xpd reach target1</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P3A_CNT_TARGET0_REACH_0_HP_INT_RAW</name>
              <description>reg_0p3a_0 counter after xpd reach target0</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P3A_CNT_TARGET1_REACH_0_HP_INT_RAW</name>
              <description>reg_0p3a_1_counter after xpd reach target1</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P3A_CNT_TARGET0_REACH_1_HP_INT_RAW</name>
              <description>reg_0p3a_0_counter after xpd reach target0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P3A_CNT_TARGET1_REACH_1_HP_INT_RAW</name>
              <description>reg_0p3a_1_counter after xpd reach target1</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_LP_CPU_EXC_INT_RAW</name>
              <description>PMU_LP_CPU_EXC_INT_RAW</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_SDIO_IDLE_INT_RAW</name>
              <description>PMU_SDIO_IDLE_INT_RAW</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_SW_INT_RAW</name>
              <description>PMU_SW_INT_RAW</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_SOC_SLEEP_REJECT_INT_RAW</name>
              <description>PMU_SOC_SLEEP_REJECT_INT_RAW</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_SOC_WAKEUP_INT_RAW</name>
              <description>PMU_SOC_WAKEUP_INT_RAW</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
