esp-rs/esp-pacs/esp32p4-lp/svd/esp32p4-lp.base.svd
        <register>
          <name>PMU_HP_INT_ST</name>
          <addressOffset>0x168</addressOffset>
          <description>PMU_HP_INT_ST</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_0P1A_CNT_TARGET0_REACH_0_HP_INT_ST</name>
              <description>reg_0p1a_0_counter after xpd reach target0</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_0P1A_CNT_TARGET1_REACH_0_HP_INT_ST</name>
              <description>reg_0p1a_1_counter after xpd reach target1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_0P1A_CNT_TARGET0_REACH_1_HP_INT_ST</name>
              <description>reg_0p1a_0 counter after xpd reach target0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_0P1A_CNT_TARGET1_REACH_1_HP_INT_ST</name>
              <description>reg_0p1a_1_counter after xpd reach target1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_0P2A_CNT_TARGET0_REACH_0_HP_INT_ST</name>
              <description>reg_0p2a_0 counter after xpd reach target0</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_0P2A_CNT_TARGET1_REACH_0_HP_INT_ST</name>
              <description>reg_0p2a_1_counter after xpd reach target1</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_0P2A_CNT_TARGET0_REACH_1_HP_INT_ST</name>
              <description>reg_0p2a_0 counter after xpd reach target0</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_0P2A_CNT_TARGET1_REACH_1_HP_INT_ST</name>
              <description>reg_0p2a_1_counter after xpd reach target1</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_0P3A_CNT_TARGET0_REACH_0_HP_INT_ST</name>
              <description>reg_0p3a_0 counter after xpd reach target0</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_0P3A_CNT_TARGET1_REACH_0_HP_INT_ST</name>
              <description>reg_0p3a_1_counter after xpd reach target1</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_0P3A_CNT_TARGET0_REACH_1_HP_INT_ST</name>
              <description>reg_0p3a_0_counter after xpd reach target0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_0P3A_CNT_TARGET1_REACH_1_HP_INT_ST</name>
              <description>reg_0p3a_1_counter after xpd reach target1</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_LP_CPU_EXC_INT_ST</name>
              <description>PMU_LP_CPU_EXC_INT_ST</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_SDIO_IDLE_INT_ST</name>
              <description>PMU_SDIO_IDLE_INT_ST</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_SW_INT_ST</name>
              <description>PMU_SW_INT_ST</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_SOC_SLEEP_REJECT_INT_ST</name>
              <description>PMU_SOC_SLEEP_REJECT_INT_ST</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_SOC_WAKEUP_INT_ST</name>
              <description>PMU_SOC_WAKEUP_INT_ST</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_HP_INT_ENA</name>
          <addressOffset>0x16c</addressOffset>
          <description>PMU_HP_INT_ENA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_0P1A_CNT_TARGET0_REACH_0_HP_INT_ENA</name>
              <description>reg_0p1a_0_counter after xpd reach target0</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P1A_CNT_TARGET1_REACH_0_HP_INT_ENA</name>
              <description>reg_0p1a_1_counter after xpd reach target1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P1A_CNT_TARGET0_REACH_1_HP_INT_ENA</name>
              <description>reg_0p1a_0 counter after xpd reach target0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P1A_CNT_TARGET1_REACH_1_HP_INT_ENA</name>
              <description>reg_0p1a_1_counter after xpd reach target1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P2A_CNT_TARGET0_REACH_0_HP_INT_ENA</name>
              <description>reg_0p2a_0 counter after xpd reach target0</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P2A_CNT_TARGET1_REACH_0_HP_INT_ENA</name>
              <description>reg_0p2a_1_counter after xpd reach target1</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P2A_CNT_TARGET0_REACH_1_HP_INT_ENA</name>
              <description>reg_0p2a_0 counter after xpd reach target0</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P2A_CNT_TARGET1_REACH_1_HP_INT_ENA</name>
              <description>reg_0p2a_1_counter after xpd reach target1</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P3A_CNT_TARGET0_REACH_0_HP_INT_ENA</name>
              <description>reg_0p3a_0 counter after xpd reach target0</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P3A_CNT_TARGET1_REACH_0_HP_INT_ENA</name>
              <description>reg_0p3a_1_counter after xpd reach target1</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P3A_CNT_TARGET0_REACH_1_HP_INT_ENA</name>
              <description>reg_0p3a_0_counter after xpd reach target0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P3A_CNT_TARGET1_REACH_1_HP_INT_ENA</name>
              <description>reg_0p3a_1_counter after xpd reach target1</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_LP_CPU_EXC_INT_ENA</name>
              <description>PMU_LP_CPU_EXC_INT_ENA</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_SDIO_IDLE_INT_ENA</name>
              <description>PMU_SDIO_IDLE_INT_ENA</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_SW_INT_ENA</name>
              <description>PMU_SW_INT_ENA</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_SOC_SLEEP_REJECT_INT_ENA</name>
              <description>PMU_SOC_SLEEP_REJECT_INT_ENA</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_SOC_WAKEUP_INT_ENA</name>
              <description>PMU_SOC_WAKEUP_INT_ENA</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_HP_INT_CLR</name>
          <addressOffset>0x170</addressOffset>
          <description>PMU_HP_INT_CLR</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_0P1A_CNT_TARGET0_REACH_0_HP_INT_CLR</name>
              <description>reg_0p1a_0_counter after xpd reach target0</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_0P1A_CNT_TARGET1_REACH_0_HP_INT_CLR</name>
              <description>reg_0p1a_1_counter after xpd reach target1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_0P1A_CNT_TARGET0_REACH_1_HP_INT_CLR</name>
              <description>reg_0p1a_0 counter after xpd reach target0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_0P1A_CNT_TARGET1_REACH_1_HP_INT_CLR</name>
              <description>reg_0p1a_1_counter after xpd reach target1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_0P2A_CNT_TARGET0_REACH_0_HP_INT_CLR</name>
              <description>reg_0p2a_0 counter after xpd reach target0</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_0P2A_CNT_TARGET1_REACH_0_HP_INT_CLR</name>
              <description>reg_0p2a_1_counter after xpd reach target1</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_0P2A_CNT_TARGET0_REACH_1_HP_INT_CLR</name>
              <description>reg_0p2a_0 counter after xpd reach target0</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_0P2A_CNT_TARGET1_REACH_1_HP_INT_CLR</name>
              <description>reg_0p2a_1_counter after xpd reach target1</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_0P3A_CNT_TARGET0_REACH_0_HP_INT_CLR</name>
              <description>reg_0p3a_0 counter after xpd reach target0</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_0P3A_CNT_TARGET1_REACH_0_HP_INT_CLR</name>
              <description>reg_0p3a_1_counter after xpd reach target1</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_0P3A_CNT_TARGET0_REACH_1_HP_INT_CLR</name>
              <description>reg_0p3a_0_counter after xpd reach target0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_0P3A_CNT_TARGET1_REACH_1_HP_INT_CLR</name>
              <description>reg_0p3a_1_counter after xpd reach target1</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_LP_CPU_EXC_INT_CLR</name>
              <description>PMU_LP_CPU_EXC_INT_CLR</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_SDIO_IDLE_INT_CLR</name>
              <description>PMU_SDIO_IDLE_INT_CLR</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_SW_INT_CLR</name>
              <description>PMU_SW_INT_CLR</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_SOC_SLEEP_REJECT_INT_CLR</name>
              <description>PMU_SOC_SLEEP_REJECT_INT_CLR</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_SOC_WAKEUP_INT_CLR</name>
              <description>PMU_SOC_WAKEUP_INT_CLR</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_LP_INT_RAW</name>
          <addressOffset>0x174</addressOffset>
          <description>PMU_LP_INT_RAW</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_LP_CPU_SLEEP_REJECT_INT_RAW</name>
              <description>PMU_LP_CPU_SLEEP_REJECT_INT_RAW</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P1A_CNT_TARGET0_REACH_0_LP_INT_RAW</name>
              <description>reg_0p1a_0_counter after xpd reach target0</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P1A_CNT_TARGET1_REACH_0_LP_INT_RAW</name>
              <description>reg_0p1a_1_counter after xpd reach target1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P1A_CNT_TARGET0_REACH_1_LP_INT_RAW</name>
              <description>reg_0p1a_0 counter after xpd reach target0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P1A_CNT_TARGET1_REACH_1_LP_INT_RAW</name>
              <description>reg_0p1a_1_counter after xpd reach target1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P2A_CNT_TARGET0_REACH_0_LP_INT_RAW</name>
              <description>reg_0p2a_0 counter after xpd reach target0</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P2A_CNT_TARGET1_REACH_0_LP_INT_RAW</name>
              <description>reg_0p2a_1_counter after xpd reach target1</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P2A_CNT_TARGET0_REACH_1_LP_INT_RAW</name>
              <description>reg_0p2a_0 counter after xpd reach target0</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P2A_CNT_TARGET1_REACH_1_LP_INT_RAW</name>
              <description>reg_0p2a_1_counter after xpd reach target1</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P3A_CNT_TARGET0_REACH_0_LP_INT_RAW</name>
              <description>reg_0p3a_0 counter after xpd reach target0</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P3A_CNT_TARGET1_REACH_0_LP_INT_RAW</name>
              <description>reg_0p3a_1_counter after xpd reach target1</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P3A_CNT_TARGET0_REACH_1_LP_INT_RAW</name>
              <description>reg_0p3a_0_counter after xpd reach target0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P3A_CNT_TARGET1_REACH_1_LP_INT_RAW</name>
              <description>reg_0p3a_1_counter after xpd reach target1</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_LP_CPU_WAKEUP_INT_RAW</name>
              <description>PMU_LP_CPU_WAKEUP_INT_RAW</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_SLEEP_SWITCH_ACTIVE_END_INT_RAW</name>
              <description>PMU_SLEEP_SWITCH_ACTIVE_END_INT_RAW</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_ACTIVE_SWITCH_SLEEP_END_INT_RAW</name>
              <description>PMU_ACTIVE_SWITCH_SLEEP_END_INT_RAW</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_SLEEP_SWITCH_ACTIVE_START_INT_RAW</name>
              <description>PMU_SLEEP_SWITCH_ACTIVE_START_INT_RAW</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_ACTIVE_SWITCH_SLEEP_START_INT_RAW</name>
              <description>PMU_ACTIVE_SWITCH_SLEEP_START_INT_RAW</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_SW_TRIGGER_INT_RAW</name>
              <description>PMU_HP_SW_TRIGGER_INT_RAW</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
