esp-rs/esp-pacs/esp32p4-lp/svd/esp32p4-lp.base.svd
        <register>
          <name>PMU_LP_INT_ST</name>
          <addressOffset>0x178</addressOffset>
          <description>PMU_LP_INT_ST</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_LP_CPU_SLEEP_REJECT_INT_ST</name>
              <description>PMU_LP_CPU_SLEEP_REJECT_INT_ST</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_0P1A_CNT_TARGET0_REACH_0_LP_INT_ST</name>
              <description>reg_0p1a_0_counter after xpd reach target0</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_0P1A_CNT_TARGET1_REACH_0_LP_INT_ST</name>
              <description>reg_0p1a_1_counter after xpd reach target1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_0P1A_CNT_TARGET0_REACH_1_LP_INT_ST</name>
              <description>reg_0p1a_0 counter after xpd reach target0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_0P1A_CNT_TARGET1_REACH_1_LP_INT_ST</name>
              <description>reg_0p1a_1_counter after xpd reach target1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_0P2A_CNT_TARGET0_REACH_0_LP_INT_ST</name>
              <description>reg_0p2a_0 counter after xpd reach target0</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_0P2A_CNT_TARGET1_REACH_0_LP_INT_ST</name>
              <description>reg_0p2a_1_counter after xpd reach target1</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_0P2A_CNT_TARGET0_REACH_1_LP_INT_ST</name>
              <description>reg_0p2a_0 counter after xpd reach target0</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_0P2A_CNT_TARGET1_REACH_1_LP_INT_ST</name>
              <description>reg_0p2a_1_counter after xpd reach target1</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_0P3A_CNT_TARGET0_REACH_0_LP_INT_ST</name>
              <description>reg_0p3a_0 counter after xpd reach target0</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_0P3A_CNT_TARGET1_REACH_0_LP_INT_ST</name>
              <description>reg_0p3a_1_counter after xpd reach target1</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_0P3A_CNT_TARGET0_REACH_1_LP_INT_ST</name>
              <description>reg_0p3a_0_counter after xpd reach target0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_0P3A_CNT_TARGET1_REACH_1_LP_INT_ST</name>
              <description>reg_0p3a_1_counter after xpd reach target1</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_LP_CPU_WAKEUP_INT_ST</name>
              <description>PMU_LP_CPU_WAKEUP_INT_ST</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_SLEEP_SWITCH_ACTIVE_END_INT_ST</name>
              <description>PMU_SLEEP_SWITCH_ACTIVE_END_INT_ST</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_ACTIVE_SWITCH_SLEEP_END_INT_ST</name>
              <description>PMU_ACTIVE_SWITCH_SLEEP_END_INT_ST</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_SLEEP_SWITCH_ACTIVE_START_INT_ST</name>
              <description>PMU_SLEEP_SWITCH_ACTIVE_START_INT_ST</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_ACTIVE_SWITCH_SLEEP_START_INT_ST</name>
              <description>PMU_ACTIVE_SWITCH_SLEEP_START_INT_ST</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_HP_SW_TRIGGER_INT_ST</name>
              <description>PMU_HP_SW_TRIGGER_INT_ST</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_LP_INT_ENA</name>
          <addressOffset>0x17c</addressOffset>
          <description>PMU_LP_INT_ENA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_LP_CPU_SLEEP_REJECT_INT_ENA</name>
              <description>PMU_LP_CPU_SLEEP_REJECT_INT_ENA</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P1A_CNT_TARGET0_REACH_0_LP_INT_ENA</name>
              <description>reg_0p1a_0_counter after xpd reach target0</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P1A_CNT_TARGET1_REACH_0_LP_INT_ENA</name>
              <description>reg_0p1a_1_counter after xpd reach target1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P1A_CNT_TARGET0_REACH_1_LP_INT_ENA</name>
              <description>reg_0p1a_0 counter after xpd reach target0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P1A_CNT_TARGET1_REACH_1_LP_INT_ENA</name>
              <description>reg_0p1a_1_counter after xpd reach target1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P2A_CNT_TARGET0_REACH_0_LP_INT_ENA</name>
              <description>reg_0p2a_0 counter after xpd reach target0</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P2A_CNT_TARGET1_REACH_0_LP_INT_ENA</name>
              <description>reg_0p2a_1_counter after xpd reach target1</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P2A_CNT_TARGET0_REACH_1_LP_INT_ENA</name>
              <description>reg_0p2a_0 counter after xpd reach target0</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P2A_CNT_TARGET1_REACH_1_LP_INT_ENA</name>
              <description>reg_0p2a_1_counter after xpd reach target1</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P3A_CNT_TARGET0_REACH_0_LP_INT_ENA</name>
              <description>reg_0p3a_0 counter after xpd reach target0</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P3A_CNT_TARGET1_REACH_0_LP_INT_ENA</name>
              <description>reg_0p3a_1_counter after xpd reach target1</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P3A_CNT_TARGET0_REACH_1_LP_INT_ENA</name>
              <description>reg_0p3a_0_counter after xpd reach target0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P3A_CNT_TARGET1_REACH_1_LP_INT_ENA</name>
              <description>reg_0p3a_1_counter after xpd reach target1</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_LP_CPU_WAKEUP_INT_ENA</name>
              <description>PMU_LP_CPU_WAKEUP_INT_ENA</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_SLEEP_SWITCH_ACTIVE_END_INT_ENA</name>
              <description>PMU_SLEEP_SWITCH_ACTIVE_END_INT_ENA</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_ACTIVE_SWITCH_SLEEP_END_INT_ENA</name>
              <description>PMU_ACTIVE_SWITCH_SLEEP_END_INT_ENA</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_SLEEP_SWITCH_ACTIVE_START_INT_ENA</name>
              <description>PMU_SLEEP_SWITCH_ACTIVE_START_INT_ENA</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_ACTIVE_SWITCH_SLEEP_START_INT_ENA</name>
              <description>PMU_ACTIVE_SWITCH_SLEEP_START_INT_ENA</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HP_SW_TRIGGER_INT_ENA</name>
              <description>PMU_HP_SW_TRIGGER_INT_ENA</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_LP_INT_CLR</name>
          <addressOffset>0x180</addressOffset>
          <description>PMU_LP_INT_CLR</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_LP_CPU_SLEEP_REJECT_LP_INT_CLR</name>
              <description>PMU_LP_CPU_SLEEP_REJECT_LP_INT_CLR</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_0P1A_CNT_TARGET0_REACH_0_LP_INT_CLR</name>
              <description>reg_0p1a_0_counter after xpd reach target0</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_0P1A_CNT_TARGET1_REACH_0_LP_INT_CLR</name>
              <description>reg_0p1a_1_counter after xpd reach target1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_0P1A_CNT_TARGET0_REACH_1_LP_INT_CLR</name>
              <description>reg_0p1a_0 counter after xpd reach target0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_0P1A_CNT_TARGET1_REACH_1_LP_INT_CLR</name>
              <description>reg_0p1a_1_counter after xpd reach target1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_0P2A_CNT_TARGET0_REACH_0_LP_INT_CLR</name>
              <description>reg_0p2a_0 counter after xpd reach target0</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_0P2A_CNT_TARGET1_REACH_0_LP_INT_CLR</name>
              <description>reg_0p2a_1_counter after xpd reach target1</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_0P2A_CNT_TARGET0_REACH_1_LP_INT_CLR</name>
              <description>reg_0p2a_0 counter after xpd reach target0</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_0P2A_CNT_TARGET1_REACH_1_LP_INT_CLR</name>
              <description>reg_0p2a_1_counter after xpd reach target1</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_0P3A_CNT_TARGET0_REACH_0_LP_INT_CLR</name>
              <description>reg_0p3a_0 counter after xpd reach target0</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_0P3A_CNT_TARGET1_REACH_0_LP_INT_CLR</name>
              <description>reg_0p3a_1_counter after xpd reach target1</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_0P3A_CNT_TARGET0_REACH_1_LP_INT_CLR</name>
              <description>reg_0p3a_0_counter after xpd reach target0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_0P3A_CNT_TARGET1_REACH_1_LP_INT_CLR</name>
              <description>reg_0p3a_1_counter after xpd reach target1</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_LP_CPU_WAKEUP_INT_CLR</name>
              <description>PMU_LP_CPU_WAKEUP_INT_CLR</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_SLEEP_SWITCH_ACTIVE_END_INT_CLR</name>
              <description>PMU_SLEEP_SWITCH_ACTIVE_END_INT_CLR</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_ACTIVE_SWITCH_SLEEP_END_INT_CLR</name>
              <description>PMU_ACTIVE_SWITCH_SLEEP_END_INT_CLR</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_SLEEP_SWITCH_ACTIVE_START_INT_CLR</name>
              <description>PMU_SLEEP_SWITCH_ACTIVE_START_INT_CLR</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_ACTIVE_SWITCH_SLEEP_START_INT_CLR</name>
              <description>PMU_ACTIVE_SWITCH_SLEEP_START_INT_CLR</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_HP_SW_TRIGGER_INT_CLR</name>
              <description>PMU_HP_SW_TRIGGER_INT_CLR</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_LP_CPU_PWR0</name>
          <addressOffset>0x184</addressOffset>
          <description>PMU_LP_CPU_PWR0</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_LP_CPU_WAITI_RDY</name>
              <description>PMU_LP_CPU_WAITI_RDY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_LP_CPU_STALL_RDY</name>
              <description>PMU_LP_CPU_STALL_RDY</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_LP_CPU_FORCE_STALL</name>
              <description>PMU_LP_CPU_FORCE_STALL</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_LP_CPU_SLP_WAITI_FLAG_EN</name>
              <description>PMU_LP_CPU_SLP_WAITI_FLAG_EN</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_LP_CPU_SLP_STALL_FLAG_EN</name>
              <description>PMU_LP_CPU_SLP_STALL_FLAG_EN</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_LP_CPU_SLP_STALL_WAIT</name>
              <description>PMU_LP_CPU_SLP_STALL_WAIT</description>
              <bitOffset>21</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_LP_CPU_SLP_STALL_EN</name>
              <description>PMU_LP_CPU_SLP_STALL_EN</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_LP_CPU_SLP_RESET_EN</name>
              <description>PMU_LP_CPU_SLP_RESET_EN</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_LP_CPU_SLP_BYPASS_INTR_EN</name>
              <description>PMU_LP_CPU_SLP_BYPASS_INTR_EN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_LP_CPU_PWR1</name>
          <addressOffset>0x188</addressOffset>
          <description>PMU_LP_CPU_PWR1</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_LP_CPU_SLEEP_REQ</name>
              <description>PMU_LP_CPU_SLEEP_REQ</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_LP_CPU_PWR2</name>
          <addressOffset>0x18c</addressOffset>
          <description>PMU_LP_CPU_PWR2</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_LP_CPU_WAKEUP_EN</name>
              <description>PMU_LP_CPU_WAKEUP_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_LP_CPU_PWR3</name>
          <addressOffset>0x190</addressOffset>
          <description>PMU_LP_CPU_PWR3</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_LP_CPU_WAKEUP_CAUSE</name>
              <description>PMU_LP_CPU_WAKEUP_CAUSE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_LP_CPU_PWR4</name>
          <addressOffset>0x194</addressOffset>
          <description>PMU_LP_CPU_PWR4</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_LP_CPU_REJECT_EN</name>
              <description>PMU_LP_CPU_REJECT_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_LP_CPU_PWR5</name>
          <addressOffset>0x198</addressOffset>
          <description>PMU_LP_CPU_PWR5</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_LP_CPU_REJECT_CAUSE</name>
              <description>PMU_LP_CPU_REJECT_CAUSE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
