esp-rs/esp-pacs/esp32p4-lp/svd/esp32p4-lp.base.svd
        <register>
          <name>PMU_HP_LP_CPU_COMM</name>
          <addressOffset>0x19c</addressOffset>
          <description>PMU_HP_LP_CPU_COMM</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_LP_TRIGGER_HP</name>
              <description>PMU_LP_TRIGGER_HP</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_HP_TRIGGER_LP</name>
              <description>PMU_HP_TRIGGER_LP</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_HP_REGULATOR_CFG</name>
          <addressOffset>0x1a0</addressOffset>
          <description>PMU_HP_REGULATOR_CFG</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_DIG_REGULATOR_EN_CAL</name>
              <description>PMU_DIG_REGULATOR_EN_CAL</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_MAIN_STATE</name>
          <addressOffset>0x1a4</addressOffset>
          <description>PMU_MAIN_STATE</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_ENABLE_CALI_PMU_CNTL</name>
              <description>PMU_ENABLE_CALI_PMU_CNTL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_PMU_MAIN_LAST_ST_STATE</name>
              <description>PMU_PMU_MAIN_LAST_ST_STATE</description>
              <bitOffset>11</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_PMU_MAIN_TAR_ST_STATE</name>
              <description>PMU_PMU_MAIN_TAR_ST_STATE</description>
              <bitOffset>18</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_PMU_MAIN_CUR_ST_STATE</name>
              <description>PMU_PMU_MAIN_CUR_ST_STATE</description>
              <bitOffset>25</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_PWR_STATE</name>
          <addressOffset>0x1a8</addressOffset>
          <description>PMU_PWR_STATE</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_PMU_BACKUP_ST_STATE</name>
              <description>PMU_PMU_BACKUP_ST_STATE</description>
              <bitOffset>13</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_PMU_LP_PWR_ST_STATE</name>
              <description>PMU_PMU_LP_PWR_ST_STATE</description>
              <bitOffset>18</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_PMU_HP_PWR_ST_STATE</name>
              <description>PMU_PMU_HP_PWR_ST_STATE</description>
              <bitOffset>23</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_CLK_STATE0</name>
          <addressOffset>0x1ac</addressOffset>
          <description>PMU_CLK_STATE0</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_STABLE_XPD_PLL_STATE</name>
              <description>PMU_STABLE_XPD_PLL_STATE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_STABLE_XPD_XTAL_STATE</name>
              <description>PMU_STABLE_XPD_XTAL_STATE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_PMU_ANA_XPD_PLL_I2C_STATE</name>
              <description>PMU_PMU_ANA_XPD_PLL_I2C_STATE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_PMU_SYS_CLK_SLP_SEL_STATE</name>
              <description>PMU_PMU_SYS_CLK_SLP_SEL_STATE</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_PMU_SYS_CLK_SEL_STATE</name>
              <description>PMU_PMU_SYS_CLK_SEL_STATE</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_PMU_SYS_CLK_NO_DIV_STATE</name>
              <description>PMU_PMU_SYS_CLK_NO_DIV_STATE</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_PMU_ICG_SYS_CLK_EN_STATE</name>
              <description>PMU_PMU_ICG_SYS_CLK_EN_STATE</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_PMU_ICG_MODEM_SWITCH_STATE</name>
              <description>PMU_PMU_ICG_MODEM_SWITCH_STATE</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_PMU_ICG_MODEM_CODE_STATE</name>
              <description>PMU_PMU_ICG_MODEM_CODE_STATE</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_PMU_ICG_SLP_SEL_STATE</name>
              <description>PMU_PMU_ICG_SLP_SEL_STATE</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_PMU_ICG_GLOBAL_XTAL_STATE</name>
              <description>PMU_PMU_ICG_GLOBAL_XTAL_STATE</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_PMU_ICG_GLOBAL_PLL_STATE</name>
              <description>PMU_PMU_ICG_GLOBAL_PLL_STATE</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_PMU_ANA_I2C_ISO_EN_STATE</name>
              <description>PMU_PMU_ANA_I2C_ISO_EN_STATE</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_PMU_ANA_I2C_RETENTION_STATE</name>
              <description>PMU_PMU_ANA_I2C_RETENTION_STATE</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_PMU_ANA_XPD_PLL_STATE</name>
              <description>PMU_PMU_ANA_XPD_PLL_STATE</description>
              <bitOffset>27</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_PMU_ANA_XPD_XTAL_STATE</name>
              <description>PMU_PMU_ANA_XPD_XTAL_STATE</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_CLK_STATE1</name>
          <addressOffset>0x1b0</addressOffset>
          <description>PMU_CLK_STATE1</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_PMU_ICG_FUNC_EN_STATE</name>
              <description>PMU_PMU_ICG_FUNC_EN_STATE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_CLK_STATE2</name>
          <addressOffset>0x1b4</addressOffset>
          <description>PMU_CLK_STATE2</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_PMU_ICG_APB_EN_STATE</name>
              <description>PMU_PMU_ICG_APB_EN_STATE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_EXT_LDO_P0_0P1A</name>
          <addressOffset>0x1b8</addressOffset>
          <description>PMU_EXT_LDO_P0_0P1A</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_0P1A_CNT_CLR_0</name>
              <description>PMU_0P1A_CNT_CLR_0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_0P1A_FORCE_TIEH_SEL_0</name>
              <description>PMU_0P1A_FORCE_TIEH_SEL_0</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P1A_XPD_0</name>
              <description>PMU_0P1A_XPD_0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P1A_TIEH_SEL_0</name>
              <description>PMU_0P1A_TIEH_SEL_0</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P1A_TIEH_POS_EN_0</name>
              <description>PMU_0P1A_TIEH_POS_EN_0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P1A_TIEH_NEG_EN_0</name>
              <description>PMU_0P1A_TIEH_NEG_EN_0</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P1A_TIEH_0</name>
              <description>PMU_0P1A_TIEH_0</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P1A_TARGET1_0</name>
              <description>PMU_0P1A_TARGET1_0</description>
              <bitOffset>15</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P1A_TARGET0_0</name>
              <description>PMU_0P1A_TARGET0_0</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P1A_LDO_CNT_PRESCALER_SEL_0</name>
              <description>PMU_0P1A_LDO_CNT_PRESCALER_SEL_0</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_EXT_LDO_P0_0P1A_ANA</name>
          <addressOffset>0x1bc</addressOffset>
          <description>PMU_EXT_LDO_P0_0P1A_ANA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_ANA_0P1A_MUL_0</name>
              <description>PMU_ANA_0P1A_MUL_0</description>
              <bitOffset>23</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_ANA_0P1A_EN_VDET_0</name>
              <description>PMU_ANA_0P1A_EN_VDET_0</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_ANA_0P1A_EN_CUR_LIM_0</name>
              <description>PMU_ANA_0P1A_EN_CUR_LIM_0</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_ANA_0P1A_DREF_0</name>
              <description>PMU_ANA_0P1A_DREF_0</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_EXT_LDO_P0_0P2A</name>
          <addressOffset>0x1c0</addressOffset>
          <description>PMU_EXT_LDO_P0_0P2A</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_0P2A_CNT_CLR_0</name>
              <description>PMU_0P2A_CNT_CLR_0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_0P2A_FORCE_TIEH_SEL_0</name>
              <description>PMU_0P2A_FORCE_TIEH_SEL_0</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P2A_XPD_0</name>
              <description>PMU_0P2A_XPD_0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P2A_TIEH_SEL_0</name>
              <description>PMU_0P2A_TIEH_SEL_0</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P2A_TIEH_POS_EN_0</name>
              <description>PMU_0P2A_TIEH_POS_EN_0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P2A_TIEH_NEG_EN_0</name>
              <description>PMU_0P2A_TIEH_NEG_EN_0</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P2A_TIEH_0</name>
              <description>PMU_0P2A_TIEH_0</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P2A_TARGET1_0</name>
              <description>PMU_0P2A_TARGET1_0</description>
              <bitOffset>15</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P2A_TARGET0_0</name>
              <description>PMU_0P2A_TARGET0_0</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P2A_LDO_CNT_PRESCALER_SEL_0</name>
              <description>PMU_0P2A_LDO_CNT_PRESCALER_SEL_0</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_EXT_LDO_P0_0P2A_ANA</name>
          <addressOffset>0x1c4</addressOffset>
          <description>PMU_EXT_LDO_P0_0P2A_ANA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_ANA_0P2A_MUL_0</name>
              <description>PMU_ANA_0P2A_MUL_0</description>
              <bitOffset>23</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_ANA_0P2A_EN_VDET_0</name>
              <description>PMU_ANA_0P2A_EN_VDET_0</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_ANA_0P2A_EN_CUR_LIM_0</name>
              <description>PMU_ANA_0P2A_EN_CUR_LIM_0</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_ANA_0P2A_DREF_0</name>
              <description>PMU_ANA_0P2A_DREF_0</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_EXT_LDO_P0_0P3A</name>
          <addressOffset>0x1c8</addressOffset>
          <description>PMU_EXT_LDO_P0_0P3A</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_0P3A_CNT_CLR_0</name>
              <description>PMU_0P3A_CNT_CLR_0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_0P3A_FORCE_TIEH_SEL_0</name>
              <description>PMU_0P3A_FORCE_TIEH_SEL_0</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P3A_XPD_0</name>
              <description>PMU_0P3A_XPD_0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P3A_TIEH_SEL_0</name>
              <description>PMU_0P3A_TIEH_SEL_0</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P3A_TIEH_POS_EN_0</name>
              <description>PMU_0P3A_TIEH_POS_EN_0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P3A_TIEH_NEG_EN_0</name>
              <description>PMU_0P3A_TIEH_NEG_EN_0</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P3A_TIEH_0</name>
              <description>PMU_0P3A_TIEH_0</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P3A_TARGET1_0</name>
              <description>PMU_0P3A_TARGET1_0</description>
              <bitOffset>15</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P3A_TARGET0_0</name>
              <description>PMU_0P3A_TARGET0_0</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P3A_LDO_CNT_PRESCALER_SEL_0</name>
              <description>PMU_0P3A_LDO_CNT_PRESCALER_SEL_0</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_EXT_LDO_P0_0P3A_ANA</name>
          <addressOffset>0x1cc</addressOffset>
          <description>PMU_EXT_LDO_P0_0P3A_ANA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_ANA_0P3A_MUL_0</name>
              <description>PMU_ANA_0P3A_MUL_0</description>
              <bitOffset>23</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_ANA_0P3A_EN_VDET_0</name>
              <description>PMU_ANA_0P3A_EN_VDET_0</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_ANA_0P3A_EN_CUR_LIM_0</name>
              <description>PMU_ANA_0P3A_EN_CUR_LIM_0</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_ANA_0P3A_DREF_0</name>
              <description>PMU_ANA_0P3A_DREF_0</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
