esp-rs/esp-pacs/esp32p4-lp/svd/esp32p4-lp.base.svd
        <register>
          <name>PMU_EXT_LDO_P1_0P1A</name>
          <addressOffset>0x1d0</addressOffset>
          <description>PMU_EXT_LDO_P1_0P1A</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_0P1A_CNT_CLR_1</name>
              <description>PMU_0P1A_CNT_CLR_1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_0P1A_FORCE_TIEH_SEL_1</name>
              <description>PMU_0P1A_FORCE_TIEH_SEL_1</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P1A_XPD_1</name>
              <description>PMU_0P1A_XPD_1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P1A_TIEH_SEL_1</name>
              <description>PMU_0P1A_TIEH_SEL_1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P1A_TIEH_POS_EN_1</name>
              <description>PMU_0P1A_TIEH_POS_EN_1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P1A_TIEH_NEG_EN_1</name>
              <description>PMU_0P1A_TIEH_NEG_EN_1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P1A_TIEH_1</name>
              <description>PMU_0P1A_TIEH_1</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P1A_TARGET1_1</name>
              <description>PMU_0P1A_TARGET1_1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P1A_TARGET0_1</name>
              <description>PMU_0P1A_TARGET0_1</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P1A_LDO_CNT_PRESCALER_SEL_1</name>
              <description>PMU_0P1A_LDO_CNT_PRESCALER_SEL_1</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_EXT_LDO_P1_0P1A_ANA</name>
          <addressOffset>0x1d4</addressOffset>
          <description>PMU_EXT_LDO_P1_0P1A_ANA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_ANA_0P1A_MUL_1</name>
              <description>PMU_ANA_0P1A_MUL_1</description>
              <bitOffset>23</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_ANA_0P1A_EN_VDET_1</name>
              <description>PMU_ANA_0P1A_EN_VDET_1</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_ANA_0P1A_EN_CUR_LIM_1</name>
              <description>PMU_ANA_0P1A_EN_CUR_LIM_1</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_ANA_0P1A_DREF_1</name>
              <description>PMU_ANA_0P1A_DREF_1</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_EXT_LDO_P1_0P2A</name>
          <addressOffset>0x1d8</addressOffset>
          <description>PMU_EXT_LDO_P1_0P2A</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_0P2A_CNT_CLR_1</name>
              <description>PMU_0P2A_CNT_CLR_1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_0P2A_FORCE_TIEH_SEL_1</name>
              <description>PMU_0P2A_FORCE_TIEH_SEL_1</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P2A_XPD_1</name>
              <description>PMU_0P2A_XPD_1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P2A_TIEH_SEL_1</name>
              <description>PMU_0P2A_TIEH_SEL_1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P2A_TIEH_POS_EN_1</name>
              <description>PMU_0P2A_TIEH_POS_EN_1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P2A_TIEH_NEG_EN_1</name>
              <description>PMU_0P2A_TIEH_NEG_EN_1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P2A_TIEH_1</name>
              <description>PMU_0P2A_TIEH_1</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P2A_TARGET1_1</name>
              <description>PMU_0P2A_TARGET1_1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P2A_TARGET0_1</name>
              <description>PMU_0P2A_TARGET0_1</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P2A_LDO_CNT_PRESCALER_SEL_1</name>
              <description>PMU_0P2A_LDO_CNT_PRESCALER_SEL_1</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_EXT_LDO_P1_0P2A_ANA</name>
          <addressOffset>0x1dc</addressOffset>
          <description>PMU_EXT_LDO_P1_0P2A_ANA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_ANA_0P2A_MUL_1</name>
              <description>PMU_ANA_0P2A_MUL_1</description>
              <bitOffset>23</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_ANA_0P2A_EN_VDET_1</name>
              <description>PMU_ANA_0P2A_EN_VDET_1</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_ANA_0P2A_EN_CUR_LIM_1</name>
              <description>PMU_ANA_0P2A_EN_CUR_LIM_1</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_ANA_0P2A_DREF_1</name>
              <description>PMU_ANA_0P2A_DREF_1</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_EXT_LDO_P1_0P3A</name>
          <addressOffset>0x1e0</addressOffset>
          <description>PMU_EXT_LDO_P1_0P3A</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_0P3A_CNT_CLR_1</name>
              <description>PMU_0P3A_CNT_CLR_1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_0P3A_FORCE_TIEH_SEL_1</name>
              <description>PMU_0P3A_FORCE_TIEH_SEL_1</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P3A_XPD_1</name>
              <description>PMU_0P3A_XPD_1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P3A_TIEH_SEL_1</name>
              <description>PMU_0P3A_TIEH_SEL_1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P3A_TIEH_POS_EN_1</name>
              <description>PMU_0P3A_TIEH_POS_EN_1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P3A_TIEH_NEG_EN_1</name>
              <description>PMU_0P3A_TIEH_NEG_EN_1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P3A_TIEH_1</name>
              <description>PMU_0P3A_TIEH_1</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P3A_TARGET1_1</name>
              <description>PMU_0P3A_TARGET1_1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P3A_TARGET0_1</name>
              <description>PMU_0P3A_TARGET0_1</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_0P3A_LDO_CNT_PRESCALER_SEL_1</name>
              <description>PMU_0P3A_LDO_CNT_PRESCALER_SEL_1</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_EXT_LDO_P1_0P3A_ANA</name>
          <addressOffset>0x1e4</addressOffset>
          <description>PMU_EXT_LDO_P1_0P3A_ANA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_ANA_0P3A_MUL_1</name>
              <description>PMU_ANA_0P3A_MUL_1</description>
              <bitOffset>23</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_ANA_0P3A_EN_VDET_1</name>
              <description>PMU_ANA_0P3A_EN_VDET_1</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_ANA_0P3A_EN_CUR_LIM_1</name>
              <description>PMU_ANA_0P3A_EN_CUR_LIM_1</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_ANA_0P3A_DREF_1</name>
              <description>PMU_ANA_0P3A_DREF_1</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_EXT_WAKEUP_LV</name>
          <addressOffset>0x1e8</addressOffset>
          <description>PMU_EXT_WAKEUP_LV</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_EXT_WAKEUP_LV</name>
              <description>PMU_EXT_WAKEUP_LV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_EXT_WAKEUP_SEL</name>
          <addressOffset>0x1ec</addressOffset>
          <description>PMU_EXT_WAKEUP_SEL</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_EXT_WAKEUP_SEL</name>
              <description>PMU_EXT_WAKEUP_SEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_EXT_WAKEUP_ST</name>
          <addressOffset>0x1f0</addressOffset>
          <description>PMU_EXT_WAKEUP_ST</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_EXT_WAKEUP_STATUS</name>
              <description>PMU_EXT_WAKEUP_STATUS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_EXT_WAKEUP_CNTL</name>
          <addressOffset>0x1f4</addressOffset>
          <description>PMU_EXT_WAKEUP_CNTL</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_EXT_WAKEUP_STATUS_CLR</name>
              <description>PMU_EXT_WAKEUP_STATUS_CLR</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_EXT_WAKEUP_FILTER</name>
              <description>PMU_EXT_WAKEUP_FILTER</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_SDIO_WAKEUP_CNTL</name>
          <addressOffset>0x1f8</addressOffset>
          <description>PMU_SDIO_WAKEUP_CNTL</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_SDIO_ACT_DNUM</name>
              <description>PMU_SDIO_ACT_DNUM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_XTAL_SLP</name>
          <addressOffset>0x1fc</addressOffset>
          <description>PMU_XTAL_SLP</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_XTAL_SLP_CNT_TARGET</name>
              <description>PMU_XTAL_SLP_CNT_TARGET</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_CPU_SW_STALL</name>
          <addressOffset>0x200</addressOffset>
          <description>PMU_CPU_SW_STALL</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_HPCORE1_SW_STALL_CODE</name>
              <description>PMU_HPCORE1_SW_STALL_CODE</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_HPCORE0_SW_STALL_CODE</name>
              <description>PMU_HPCORE0_SW_STALL_CODE</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_DCM_CTRL</name>
          <addressOffset>0x204</addressOffset>
          <description>PMU_DCM_CTRL</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_DCDC_ON_REQ</name>
              <description>SW trigger dcdc on</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_DCDC_OFF_REQ</name>
              <description>SW trigger dcdc off</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_DCDC_LIGHTSLP_REQ</name>
              <description>SW trigger dcdc enter lightsleep</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_DCDC_DEEPSLP_REQ</name>
              <description>SW trigger dcdc enter deepsleep</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_DCDC_DONE_FORCE</name>
              <description>PMU_DCDC_DONE_FORCE</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_DCDC_ON_FORCE_PU</name>
              <description>PMU_DCDC_ON_FORCE_PU</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_DCDC_ON_FORCE_PD</name>
              <description>PMU_DCDC_ON_FORCE_PD</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_DCDC_FB_RES_FORCE_PU</name>
              <description>PMU_DCDC_FB_RES_FORCE_PU</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_DCDC_FB_RES_FORCE_PD</name>
              <description>PMU_DCDC_FB_RES_FORCE_PD</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_DCDC_LS_FORCE_PU</name>
              <description>PMU_DCDC_LS_FORCE_PU</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_DCDC_LS_FORCE_PD</name>
              <description>PMU_DCDC_LS_FORCE_PD</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_DCDC_DS_FORCE_PU</name>
              <description>PMU_DCDC_DS_FORCE_PU</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_DCDC_DS_FORCE_PD</name>
              <description>PMU_DCDC_DS_FORCE_PD</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_DCM_CUR_ST</name>
              <description>PMU_DCM_CUR_ST</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_DCDC_EN_AMUX_TEST</name>
              <description>Enable analog mux to pull PAD TEST_DCDC voltage signal</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_DCM_WAIT_DELAY</name>
          <addressOffset>0x208</addressOffset>
          <description>PMU_DCM_WAIT_DELAY</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_DCDC_PRE_DELAY</name>
              <description>DCDC pre-on/post off delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_DCDC_RES_OFF_DELAY</name>
              <description>DCDC fb res off delay</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_DCDC_STABLE_DELAY</name>
              <description>DCDC stable delay</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_VDDBAT_CFG</name>
          <addressOffset>0x20c</addressOffset>
          <description>PMU_VDDBAT_CFG</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_ANA_VDDBAT_MODE</name>
              <description>PMU_ANA_VDDBAT_MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_VDDBAT_SW_UPDATE</name>
              <description>PMU_VDDBAT_SW_UPDATE</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
