esp-rs/esp-pacs/esp32p4-lp/svd/esp32p4-lp.base.svd
        <register>
          <name>PMU_TOUCH_PWR_CNTL</name>
          <addressOffset>0x210</addressOffset>
          <description>PMU_TOUCH_PWR_CNTL</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_TOUCH_WAIT_CYCLES</name>
              <description>PMU_TOUCH_WAIT_CYCLES</description>
              <bitOffset>5</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_TOUCH_SLEEP_CYCLES</name>
              <description>PMU_TOUCH_SLEEP_CYCLES</description>
              <bitOffset>14</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_TOUCH_FORCE_DONE</name>
              <description>PMU_TOUCH_FORCE_DONE</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_TOUCH_SLEEP_TIMER_EN</name>
              <description>PMU_TOUCH_SLEEP_TIMER_EN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_RDN_ECO</name>
          <addressOffset>0x214</addressOffset>
          <description>PMU_RDN_ECO</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_PMU_RDN_ECO_RESULT</name>
              <description>PMU_PMU_RDN_ECO_RESULT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMU_PMU_RDN_ECO_EN</name>
              <description>PMU_PMU_RDN_ECO_EN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_POWER_PD_HP_CPU_CNTL</name>
          <addressOffset>0x218</addressOffset>
          <description>PMU_POWER_PD_HP_CPU_CNTL</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_FORCE_HP_CPU_RESET</name>
              <description>PMU_FORCE_HP_CPU_RESET</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_FORCE_HP_CPU_ISO</name>
              <description>PMU_FORCE_HP_CPU_ISO</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_FORCE_HP_CPU_PU</name>
              <description>PMU_FORCE_HP_CPU_PU</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_FORCE_HP_CPU_NO_RESET</name>
              <description>PMU_FORCE_HP_CPU_NO_RESET</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_FORCE_HP_CPU_NO_ISO</name>
              <description>PMU_FORCE_HP_CPU_NO_ISO</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_FORCE_HP_CPU_PD</name>
              <description>PMU_FORCE_HP_CPU_PD</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_POWER_PD_HP_CPU_MASK</name>
          <addressOffset>0x21c</addressOffset>
          <description>PMU_POWER_PD_HP_CPU_MASK</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_XPD_HP_CPU_MASK</name>
              <description>PMU_XPD_HP_CPU_MASK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_PD_HP_CPU_MASK</name>
              <description>PMU_PD_HP_CPU_MASK</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_DATE</name>
          <addressOffset>0x3fc</addressOffset>
          <description>PMU_DATE</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMU_PMU_DATE</name>
              <description>PMU_PMU_DATE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_CLK_EN</name>
              <description>PMU_CLK_EN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
